<PAD>	0
<UNK>	0
<BOS>	0
<EOS>	0
<MASK>	0
/*	959
*	25557
cllm	378
lattice	917
conversion	91
utilities	98
*/	4662
#include	3815
"../../include/cllm.h"	7
"../../include/bigfixed_core.h"	14
"../../include/bigint_core.h"	21
"../../include/prime_types.h"	7
<stdlib.h>	532
<string.h>	546
<stdio.h>	476
"../include/prime_float_math.h"	231
void	3633
cllm_float_to_bigfixed(bigfixed*	7
output,	161
float*	2212
input,	175
int	6727
n,	364
precision)	105
{	31227
(void)precision;	28
unused	77
parameter	84
-	5544
kept	14
for	10661
api	70
compatibility	49
if	23282
(!output	21
||	6713
!input	84
n	973
<=	1799
0)	3801
return;	3570
(int	3493
i	9926
=	45213
0;	11424
<	9373
n;	490
i++)	4403
big_fixed_from_double(&output[i],	7
(double)input[i]);	7
}	31101
cllm_bigfixed_to_float(float*	7
bigfixed*	105
n)	518
output[i]	49
(float)big_fixed_to_double(&input[i]);	7
cllm_embeddings_to_basis(bigfixed**	7
basis,	133
embeddings,	35
dim,	126
(!basis	28
!embeddings	7
0	1918
dim	567
cllm_float_to_bigfixed(basis[i],	7
&embeddings[i	7
dim],	21
precision);	91
cllm_basis_to_embeddings(float*	7
bigfixed**	105
dim)	168
(!embeddings	21
!basis	42
cllm_bigfixed_to_float(&embeddings[i	7
basis[i],	7
dim);	161
cllm_alloc_bigfixed_basis(int	7
(n	602
return	14448
null;	3185
basis	420
(bigfixed**)malloc(n	35
sizeof(bigfixed*));	42
(!basis)	14
basis[i]	14
(bigfixed*)malloc(dim	28
sizeof(bigfixed));	70
(!basis[i])	7
j	1624
i;	483
j++)	721
free(basis[j]);	7
free(basis);	14
d	882
dim;	406
d++)	350
big_fixed_from_int(&basis[i][d],	7
0);	1148
basis;	21
cllm_free_bigfixed_basis(bigfixed**	7
(basis[i])	7
free(basis[i]);	7
cllm_embedding_to_bigfixed(bigfixed*	7
embedding,	119
cllm_float_to_bigfixed(output,	7
cllm_bigfixed_to_embedding(float*	7
vector,	21
cllm_bigfixed_to_float(embedding,	7
float	4725
cllm_test_conversion_accuracy(float*	7
(!input	21
-1.0f;	49
bigfixed	1491
(bigfixed*)malloc(n	35
output	595
(float*)malloc(n	7
sizeof(float));	1603
(!bigfixed	7
!output)	56
(bigfixed)	7
free(bigfixed);	14
(output)	35
free(output);	91
cllm_float_to_bigfixed(bigfixed,	7
cllm_bigfixed_to_float(output,	7
bigfixed,	7
n);	168
max_error	28
0.0f;	1631
error	56
prime_fabsf(output[i]	7
input[i]);	7
(error	49
>	2919
max_error)	7
error;	7
max_error;	14
cllm_print_conversion_stats(float*	7
cllm_test_conversion_accuracy(input,	7
printf("conversion	7
statistics:\n");	84
printf("	1687
elements:	7
%d\n",	574
precision:	49
%d	413
bits\n",	7
max	168
error:	21
%.10e\n",	7
max_error);	7
(max_error	21
1e-6f)	21
status:	28
excellent	7
1e-6)\n");	7
else	1330
1e-4f)	7
good	28
1e-4)\n");	7
1e-2f)	7
acceptable	7
1e-2)\n");	14
warning	70
>=	1274
pure	70
crystalline	406
embeddings	399
implementation	315
implements	119
crystallineembeddings	21
with	1106
lll-reduced	14
exact	35
token	826
positions,	7
and	1211
morphology	35
graph.	7
implementation:	35
uses	287
only	98
arbitrary	105
precision	343
mathematics.	14
no	322
external	49
math	63
libraries	14
(math.h,	14
gmp,	14
etc.)	35
"cllm_pure_crystalline.h"	21
helper	147
function	231
to	3759
allocate	980
matrix	350
static	1589
allocate_bigfixed_matrix(uint32_t	7
rows,	28
uint32_t	2170
cols,	7
(bigfixed**)malloc(rows	7
(!matrix)	14
(uint32_t	1890
rows;	70
matrix[i]	7
(bigfixed*)malloc(cols	7
(!matrix[i])	7
//	26425
cleanup	301
on	469
failure	63
free(matrix[j]);	7
free(matrix);	21
initialize	1274
each	315
cols;	77
bigint	1582
structures	63
matrix[i][j].integer_part	7
(bigint*)malloc(sizeof(bigint));	385
matrix[i][j].fractional_part	7
(!matrix[i][j].integer_part	7
!matrix[i][j].fractional_part)	7
k	420
k++)	91
l	70
l++)	28
big_free(matrix[k][l].integer_part);	7
free(matrix[k][l].integer_part);	7
big_free(matrix[k][l].fractional_part);	7
free(matrix[k][l].fractional_part);	7
free(matrix[k]);	7
(j	28
j;	126
big_free(matrix[i][l].integer_part);	7
free(matrix[i][l].integer_part);	7
big_free(matrix[i][l].fractional_part);	7
free(matrix[i][l].fractional_part);	7
free(matrix[i]);	14
big_init(matrix[i][j].integer_part);	7
big_init(matrix[i][j].fractional_part);	7
matrix[i][j].scale_bits	7
precision;	56
matrix[i][j].negative	7
matrix;	7
free	812
free_bigfixed_matrix(bigfixed**	7
matrix,	21
cols)	21
(matrix[i])	7
(matrix[i][j].integer_part)	7
big_free(matrix[i][j].integer_part);	7
free(matrix[i][j].integer_part);	7
(matrix[i][j].fractional_part)	7
big_free(matrix[i][j].fractional_part);	7
free(matrix[i][j].fractional_part);	7
create	847
new	168
structure	343
crystallineembeddings*	14
crystalline_embeddings_create(uint32_t	7
vocab_size,	91
lattice_dim)	7
(vocab_size	14
==	4508
lattice_dim	14
fprintf(stderr,	2044
"error:	1148
vocab_size	378
must	210
be	420
0\n");	140
(crystallineembeddings*)malloc(sizeof(crystallineembeddings));	7
(!embeddings)	28
failed	497
crystallineembeddings\n");	7
embeddings->vocab_size	7
vocab_size;	315
embeddings->lattice_dim	21
lattice_dim;	7
embeddings->basis_optimized	7
false;	2121
embeddings->optimization_epoch	7
embeddings->total_lookups	7
embeddings->cache_hits	7
embeddings->avg_lookup_time	7
0.0;	777
(identity	7
initially)	7
embeddings->lattice_basis	7
allocate_bigfixed_matrix(lattice_dim,	14
lattice_dim,	112
256);	49
(!embeddings->lattice_basis)	7
free(embeddings);	63
inverse	210
embeddings->inverse_basis	7
(!embeddings->inverse_basis)	7
free_bigfixed_matrix(embeddings->lattice_basis,	56
lattice_dim);	119
array	413
embeddings->tokens	7
(crystallinetoken**)calloc(vocab_size,	7
sizeof(crystallinetoken*));	7
(!embeddings->tokens)	7
free_bigfixed_matrix(embeddings->inverse_basis,	49
positions	56
embeddings->token_positions	7
allocate_bigfixed_matrix(vocab_size,	7
(!embeddings->token_positions)	7
free(embeddings->tokens);	42
primes	210
embeddings->token_primes	7
(uint64_t*)calloc(vocab_size,	7
sizeof(uint64_t));	35
(!embeddings->token_primes)	7
free_bigfixed_matrix(embeddings->token_positions,	35
graph	14
embeddings->morphology_graph	7
(uint32_t**)malloc(vocab_size	7
sizeof(uint32_t*));	7
(!embeddings->morphology_graph)	7
free(embeddings->token_primes);	28
embeddings->morphology_graph[i]	7
(uint32_t*)calloc(max_derived_tokens,	7
sizeof(uint32_t));	280
(!embeddings->morphology_graph[i])	7
free(embeddings->morphology_graph[j]);	7
free(embeddings->morphology_graph);	21
counts	21
embeddings->morphology_counts	7
(uint8_t*)calloc(vocab_size,	7
sizeof(uint8_t));	7
(!embeddings->morphology_counts)	7
free(embeddings->morphology_graph[i]);	14
embeddings;	7
crystalline_embeddings_free(crystallineembeddings*	7
embeddings)	14
(embeddings->morphology_counts)	7
free(embeddings->morphology_counts);	7
(embeddings->morphology_graph)	7
embeddings->vocab_size;	7
(embeddings->morphology_graph[i])	7
(embeddings->token_primes)	7
(embeddings->token_positions)	7
embeddings->vocab_size,	7
embeddings->lattice_dim);	21
tokens	602
(but	7
don't	84
the	1078
objects	7
themselves	7
they're	28
owned	21
by	420
caller)	7
(embeddings->tokens)	7
(embeddings->inverse_basis)	7
embeddings->lattice_dim,	14
(embeddings->lattice_basis)	7
add	427
bool	1148
crystalline_embeddings_add_token(crystallineembeddings*	7
crystallinetoken*	28
token)	42
!token)	21
null	224
or	315
token\n");	7
(token->token_id	7
embeddings->vocab_size)	21
token_id	203
%u	210
%u\n",	413
token->token_id,	7
embeddings->vocab_size);	21
store	126
pointer	56
embeddings->tokens[token->token_id]	7
token;	42
prime	1323
embeddings->token_primes[token->token_id]	7
token->prime;	7
copy	371
position	448
(from	14
ulam	147
spiral	245
coordinates)	7
&&	2051
3;	308
big_fixed_assign(&embeddings->token_positions[token->token_id][i],	7
&token->lattice_coords[i]);	7
true;	994
get	686
from	945
crystalline_embeddings_get_token(crystallineembeddings*	7
token_id)	42
embeddings\n");	28
(token_id	140
token_id,	126
embeddings->tokens[token_id];	7
identity	77
crystalline_initialize_basis(crystallineembeddings*	7
set	364
embeddings->lattice_dim;	28
(i	392
j)	56
1.0	168
big_from_int(embeddings->lattice_basis[i][j].integer_part,	14
1);	1512
big_from_int(embeddings->lattice_basis[i][j].fractional_part,	14
0.0	98
embeddings->lattice_basis[i][j].negative	7
(same	21
as	231
identity)	7
big_from_int(embeddings->inverse_basis[i][j].integer_part,	14
big_from_int(embeddings->inverse_basis[i][j].fractional_part,	14
embeddings->inverse_basis[i][j].negative	7
compute	1211
(currently	7
just	147
copies	14
token's	28
lattice_coords)	7
crystalline_compute_token_position(crystallineembeddings*	7
position[3])	7
!position)	7
position\n");	28
stored	49
big_fixed_assign(&position[i],	7
&embeddings->token_positions[token_id][i]);	7
operations	252
"../../include/cllm_pure_crystalline.h"	7
"../../include/prime_math_custom.h"	7
"../../include/prime_bigint_transcendental.h"	7
"../../include/bigfixed_constants.h"	7
#define	350
prime_cache_size	14
10000	21
uint64_t	2436
prime_cache[prime_cache_size];	14
prime_cache_initialized	28
integer	273
square	63
root	245
using	672
newton's	35
method	21
floating	7
point	70
isqrt(uint64_t	14
3)	70
1;	1939
initial	56
guess	42
x	1176
y	224
(x	644
+	6118
1)	1064
/	3556
2;	637
method:	21
x_new	14
n/x)	21
2	672
while	1043
(y	119
x)	497
y;	140
x;	217
init_prime_cache(void)	14
(prime_cache_initialized)	14
prime_cache[0]	14
prime_cache[1]	14
count	763
candidate	147
5;	91
(count	119
prime_cache_size)	35
is_prime	112
sqrt_cand	14
isqrt(candidate);	7
prime_cache[i]	35
sqrt_cand;	14
(candidate	21
%	1029
break;	1302
(is_prime)	42
