<PAD>	0
<UNK>	0
<BOS>	0
<EOS>	0
<MASK>	0
/*	959
*	25165
cllm	371
lattice	917
conversion	91
utilities	98
*/	4487
#include	3654
"../../include/cllm.h"	7
"../../include/bigfixed_core.h"	14
"../../include/bigint_core.h"	21
"../../include/prime_types.h"	7
<stdlib.h>	518
<string.h>	525
<stdio.h>	462
"../include/prime_float_math.h"	231
void	3451
cllm_float_to_bigfixed(bigfixed*	7
output,	161
float*	2163
input,	175
int	6482
n,	364
precision)	105
{	30233
(void)precision;	28
unused	77
parameter	84
-	5432
kept	14
for	10199
api	49
compatibility	49
if	22582
(!output	21
||	6629
!input	84
n	959
<=	1701
0)	3710
return;	3486
(int	3395
i	9457
=	43778
0;	10864
<	9072
n;	490
i++)	4193
big_fixed_from_double(&output[i],	7
(double)input[i]);	7
}	30107
cllm_bigfixed_to_float(float*	7
bigfixed*	105
n)	518
output[i]	49
(float)big_fixed_to_double(&input[i]);	7
cllm_embeddings_to_basis(bigfixed**	7
basis,	133
embeddings,	35
dim,	126
(!basis	28
!embeddings	7
0	1890
dim	567
cllm_float_to_bigfixed(basis[i],	7
&embeddings[i	7
dim],	21
precision);	91
cllm_basis_to_embeddings(float*	7
bigfixed**	105
dim)	168
(!embeddings	21
!basis	42
cllm_bigfixed_to_float(&embeddings[i	7
basis[i],	7
dim);	161
cllm_alloc_bigfixed_basis(int	7
(n	602
return	14042
null;	3031
basis	420
(bigfixed**)malloc(n	35
sizeof(bigfixed*));	42
(!basis)	14
basis[i]	14
(bigfixed*)malloc(dim	28
sizeof(bigfixed));	70
(!basis[i])	7
j	1540
i;	469
j++)	679
free(basis[j]);	7
free(basis);	14
d	882
dim;	406
d++)	350
big_fixed_from_int(&basis[i][d],	7
0);	1148
basis;	21
cllm_free_bigfixed_basis(bigfixed**	7
(basis[i])	7
free(basis[i]);	7
cllm_embedding_to_bigfixed(bigfixed*	7
embedding,	119
cllm_float_to_bigfixed(output,	7
cllm_bigfixed_to_embedding(float*	7
vector,	21
cllm_bigfixed_to_float(embedding,	7
float	4606
cllm_test_conversion_accuracy(float*	7
(!input	21
-1.0f;	49
bigfixed	1491
(bigfixed*)malloc(n	35
output	595
(float*)malloc(n	7
sizeof(float));	1547
(!bigfixed	7
!output)	56
(bigfixed)	7
free(bigfixed);	14
(output)	35
free(output);	91
cllm_float_to_bigfixed(bigfixed,	7
cllm_bigfixed_to_float(output,	7
bigfixed,	7
n);	168
max_error	28
0.0f;	1547
error	56
prime_fabsf(output[i]	7
input[i]);	7
(error	42
>	2863
max_error)	7
error;	7
max_error;	14
cllm_print_conversion_stats(float*	7
cllm_test_conversion_accuracy(input,	7
printf("conversion	7
statistics:\n");	77
printf("	1610
elements:	7
%d\n",	553
precision:	49
%d	357
bits\n",	7
max	168
error:	14
%.10e\n",	7
max_error);	7
(max_error	21
1e-6f)	21
status:	28
excellent	7
1e-6)\n");	7
else	1302
1e-4f)	7
good	28
1e-4)\n");	7
1e-2f)	7
acceptable	7
1e-2)\n");	14
warning	70
>=	1239
pure	70
crystalline	406
embeddings	399
implementation	294
implements	119
crystallineembeddings	21
with	1029
lll-reduced	14
exact	35
token	826
positions,	7
and	1197
morphology	35
graph.	7
implementation:	35
uses	266
only	84
arbitrary	105
precision	343
mathematics.	14
no	322
external	49
math	63
libraries	14
(math.h,	14
gmp,	14
etc.)	35
"cllm_pure_crystalline.h"	21
helper	140
function	217
to	3563
allocate	945
matrix	350
static	1372
allocate_bigfixed_matrix(uint32_t	7
rows,	28
uint32_t	1967
cols,	7
(bigfixed**)malloc(rows	7
(!matrix)	14
(uint32_t	1757
rows;	70
matrix[i]	7
(bigfixed*)malloc(cols	7
(!matrix[i])	7
//	25515
cleanup	287
on	455
failure	56
free(matrix[j]);	7
free(matrix);	21
initialize	1260
each	287
cols;	77
bigint	1582
structures	63
matrix[i][j].integer_part	7
(bigint*)malloc(sizeof(bigint));	385
matrix[i][j].fractional_part	7
(!matrix[i][j].integer_part	7
!matrix[i][j].fractional_part)	7
k	420
k++)	91
l	70
l++)	28
big_free(matrix[k][l].integer_part);	7
free(matrix[k][l].integer_part);	7
big_free(matrix[k][l].fractional_part);	7
free(matrix[k][l].fractional_part);	7
free(matrix[k]);	7
(j	28
j;	119
big_free(matrix[i][l].integer_part);	7
free(matrix[i][l].integer_part);	7
big_free(matrix[i][l].fractional_part);	7
free(matrix[i][l].fractional_part);	7
free(matrix[i]);	14
big_init(matrix[i][j].integer_part);	7
big_init(matrix[i][j].fractional_part);	7
matrix[i][j].scale_bits	7
precision;	56
matrix[i][j].negative	7
matrix;	7
free	770
free_bigfixed_matrix(bigfixed**	7
matrix,	21
cols)	21
(matrix[i])	7
(matrix[i][j].integer_part)	7
big_free(matrix[i][j].integer_part);	7
free(matrix[i][j].integer_part);	7
(matrix[i][j].fractional_part)	7
big_free(matrix[i][j].fractional_part);	7
free(matrix[i][j].fractional_part);	7
create	777
new	168
structure	343
crystallineembeddings*	14
crystalline_embeddings_create(uint32_t	7
vocab_size,	91
lattice_dim)	7
(vocab_size	14
==	4417
lattice_dim	14
fprintf(stderr,	2002
"error:	1141
vocab_size	378
must	210
be	413
0\n");	140
(crystallineembeddings*)malloc(sizeof(crystallineembeddings));	7
(!embeddings)	28
failed	462
crystallineembeddings\n");	7
embeddings->vocab_size	7
vocab_size;	315
embeddings->lattice_dim	21
lattice_dim;	7
embeddings->basis_optimized	7
false;	2100
embeddings->optimization_epoch	7
embeddings->total_lookups	7
embeddings->cache_hits	7
embeddings->avg_lookup_time	7
0.0;	777
(identity	7
initially)	7
embeddings->lattice_basis	7
allocate_bigfixed_matrix(lattice_dim,	14
lattice_dim,	112
256);	49
(!embeddings->lattice_basis)	7
free(embeddings);	63
inverse	210
embeddings->inverse_basis	7
(!embeddings->inverse_basis)	7
free_bigfixed_matrix(embeddings->lattice_basis,	56
lattice_dim);	119
array	392
embeddings->tokens	7
(crystallinetoken**)calloc(vocab_size,	7
sizeof(crystallinetoken*));	7
(!embeddings->tokens)	7
free_bigfixed_matrix(embeddings->inverse_basis,	49
positions	56
embeddings->token_positions	7
allocate_bigfixed_matrix(vocab_size,	7
(!embeddings->token_positions)	7
free(embeddings->tokens);	42
primes	210
embeddings->token_primes	7
(uint64_t*)calloc(vocab_size,	7
sizeof(uint64_t));	35
(!embeddings->token_primes)	7
free_bigfixed_matrix(embeddings->token_positions,	35
graph	14
embeddings->morphology_graph	7
(uint32_t**)malloc(vocab_size	7
sizeof(uint32_t*));	7
(!embeddings->morphology_graph)	7
free(embeddings->token_primes);	28
embeddings->morphology_graph[i]	7
(uint32_t*)calloc(max_derived_tokens,	7
sizeof(uint32_t));	280
(!embeddings->morphology_graph[i])	7
free(embeddings->morphology_graph[j]);	7
free(embeddings->morphology_graph);	21
counts	21
embeddings->morphology_counts	7
(uint8_t*)calloc(vocab_size,	7
sizeof(uint8_t));	7
(!embeddings->morphology_counts)	7
free(embeddings->morphology_graph[i]);	14
embeddings;	7
crystalline_embeddings_free(crystallineembeddings*	7
embeddings)	14
(embeddings->morphology_counts)	7
free(embeddings->morphology_counts);	7
(embeddings->morphology_graph)	7
embeddings->vocab_size;	7
(embeddings->morphology_graph[i])	7
(embeddings->token_primes)	7
(embeddings->token_positions)	7
embeddings->vocab_size,	7
embeddings->lattice_dim);	21
tokens	588
(but	7
don't	77
the	987
objects	7
themselves	7
they're	28
owned	21
by	413
caller)	7
(embeddings->tokens)	7
(embeddings->inverse_basis)	7
embeddings->lattice_dim,	14
(embeddings->lattice_basis)	7
add	427
bool	1148
crystalline_embeddings_add_token(crystallineembeddings*	7
crystallinetoken*	28
token)	42
!token)	21
null	224
or	315
token\n");	7
(token->token_id	7
embeddings->vocab_size)	21
token_id	203
%u	182
%u\n",	357
token->token_id,	7
embeddings->vocab_size);	21
store	119
pointer	42
embeddings->tokens[token->token_id]	7
token;	42
prime	1323
embeddings->token_primes[token->token_id]	7
token->prime;	7
copy	357
position	448
(from	14
ulam	147
spiral	245
coordinates)	7
&&	2002
3;	294
big_fixed_assign(&embeddings->token_positions[token->token_id][i],	7
&token->lattice_coords[i]);	7
true;	980
get	637
from	917
crystalline_embeddings_get_token(crystallineembeddings*	7
token_id)	42
embeddings\n");	28
(token_id	140
token_id,	126
embeddings->tokens[token_id];	7
identity	77
crystalline_initialize_basis(crystallineembeddings*	7
set	350
embeddings->lattice_dim;	28
(i	385
j)	56
1.0	168
big_from_int(embeddings->lattice_basis[i][j].integer_part,	14
1);	1491
big_from_int(embeddings->lattice_basis[i][j].fractional_part,	14
0.0	98
embeddings->lattice_basis[i][j].negative	7
(same	21
as	231
identity)	7
big_from_int(embeddings->inverse_basis[i][j].integer_part,	14
big_from_int(embeddings->inverse_basis[i][j].fractional_part,	14
embeddings->inverse_basis[i][j].negative	7
compute	1211
(currently	7
just	140
copies	14
token's	28
lattice_coords)	7
crystalline_compute_token_position(crystallineembeddings*	7
position[3])	7
!position)	7
position\n");	28
stored	42
big_fixed_assign(&position[i],	7
&embeddings->token_positions[token_id][i]);	7
operations	224
"../../include/cllm_pure_crystalline.h"	7
"../../include/prime_math_custom.h"	7
"../../include/prime_bigint_transcendental.h"	7
"../../include/bigfixed_constants.h"	7
#define	350
prime_cache_size	14
10000	21
uint64_t	2422
prime_cache[prime_cache_size];	14
prime_cache_initialized	28
integer	273
square	63
root	217
using	644
newton's	35
method	21
floating	7
point	70
isqrt(uint64_t	14
3)	70
1;	1869
initial	56
guess	42
x	1176
y	224
(x	644
+	5999
1)	1015
/	3486
2;	623
method:	21
x_new	14
n/x)	21
2	658
while	1008
(y	119
x)	497
y;	140
x;	217
init_prime_cache(void)	14
(prime_cache_initialized)	14
prime_cache[0]	14
prime_cache[1]	14
count	728
candidate	147
5;	91
(count	119
prime_cache_size)	35
is_prime	112
sqrt_cand	14
isqrt(candidate);	7
prime_cache[i]	35
sqrt_cand;	14
(candidate	21
%	1022
break;	1204
(is_prime)	42
prime_cache[count++]	14
candidate;	84
+=	2625
crystalline_is_prime(uint64_t	7
2)	434
sqrt_n	21
isqrt(n);	14
(uint64_t	294
sqrt_n;	21
crystalline_get_nth_prime(uint32_t	7
init_prime_cache();	42
prime_cache[n];	14
prime_cache_size;	42
prime_cache[prime_cache_size	21
1]	168
(crystalline_is_prime(candidate))	7
count++;	161
crystalline_factorize(uint64_t	7
number,	14
uint64_t*	147
factors,	21
uint8_t*	7
num_factors)	14
(!factors	7
!num_factors)	7
*num_factors	49
(number	35
(crystalline_is_prime(number))	7
factors[0]	7
number;	21
max_prime_factors)	14
factors[(*num_factors)++]	21
number	686
/=	280
max_prime_factors;	7
1	651
crystalline_compute_ulam_position(uint64_t	7
prime,	238
coords[3],	14
(!coords)	21
needed	168
(!coords[i].integer_part)	7
coords[i].integer_part	7
big_init(coords[i].integer_part);	7
(!coords[i].fractional_part)	7
coords[i].fractional_part	7
big_init(coords[i].fractional_part);	7
coords[i].scale_bits	7
coords[i].negative	7
find	420
index	203
prime_index	84
(prime_cache[i]	21
prime)	245
not	378
in	1596
cache,	28
estimate	119
(prime_index	14
1])	7
approximate:	7
≈	196
ln(prime)	7
simplicity,	14
use	861
10	84
rough	35
(uint32_t)(prime	21
10);	35
bigint*	217
idx	182
big_init(idx);	7
big_from_int(idx,	7
prime_index);	14
radius	210
sqrt(prime_index)	7
radius;	14
radius.integer_part	7
radius.fractional_part	7
big_init(radius.integer_part);	7
big_init(radius.fractional_part);	7
radius.scale_bits	7
radius.negative	7
big_sqrt(&radius,	7
idx,	7
angle	385
golden_angle	91
2π	49
φ²	14
2.39996322972865332	7
radians	70
golden_angle;	21
golden_angle.integer_part	7
golden_angle.fractional_part	7
big_init(golden_angle.integer_part);	7
big_init(golden_angle.fractional_part);	7
golden_angle.scale_bits	7
golden_angle.negative	7
big_fixed_from_double(&golden_angle,	7
2.39996322972865332);	7
angle;	49
angle.integer_part	7
angle.fractional_part	7
big_init(angle.integer_part);	7
big_init(angle.fractional_part);	7
angle.scale_bits	7
angle.negative	7
idx_fixed;	7
idx_fixed.integer_part	7
idx_fixed.fractional_part	7
big_init(idx_fixed.integer_part);	7
big_init(idx_fixed.fractional_part);	7
idx_fixed.scale_bits	7
idx_fixed.negative	7
big_fixed_from_int(&idx_fixed,	7
big_fixed_mul(&angle,	7
&golden_angle,	7
&idx_fixed);	7
cos(angle)	7
cos_angle;	7
cos_angle.integer_part	7
cos_angle.fractional_part	7
big_init(cos_angle.integer_part);	7
big_init(cos_angle.fractional_part);	7
cos_angle.scale_bits	7
cos_angle.negative	7
big_cos(&cos_angle,	7
&angle,	21
big_fixed_mul(&coords[0],	7
&radius,	14
&cos_angle);	7
sin(angle)	7
sin_angle;	7
sin_angle.integer_part	7
sin_angle.fractional_part	7
big_init(sin_angle.integer_part);	7
big_init(sin_angle.fractional_part);	7
sin_angle.scale_bits	7
sin_angle.negative	7
big_sin(&sin_angle,	7
big_fixed_mul(&coords[1],	7
&sin_angle);	7
z	70
ln(prime	7
prime_plus_1	7
big_init(prime_plus_1);	7
big_from_int(prime_plus_1,	7
big_ln(&coords[2],	7
prime_plus_1,	7
temporary	84
bigfixed/bigint	7
big_free(prime_plus_1);	7
free(prime_plus_1);	7
big_free(sin_angle.integer_part);	7
free(sin_angle.integer_part);	7
big_free(sin_angle.fractional_part);	7
free(sin_angle.fractional_part);	7
big_free(cos_angle.integer_part);	7
free(cos_angle.integer_part);	7
big_free(cos_angle.fractional_part);	7
free(cos_angle.fractional_part);	7
big_free(idx_fixed.integer_part);	7
free(idx_fixed.integer_part);	7
big_free(idx_fixed.fractional_part);	7
free(idx_fixed.fractional_part);	7
big_free(angle.integer_part);	7
free(angle.integer_part);	7
big_free(angle.fractional_part);	7
free(angle.fractional_part);	7
big_free(golden_angle.integer_part);	7
free(golden_angle.integer_part);	7
big_free(golden_angle.fractional_part);	7
free(golden_angle.fractional_part);	7
big_free(radius.integer_part);	7
free(radius.integer_part);	7
big_free(radius.fractional_part);	7
free(radius.fractional_part);	7
big_free(idx);	7
free(idx);	7
crystalline_token_create(uint32_t	7
const	2534
char*	1302
token_str,	28
(crystallinetoken*)calloc(1,	7
sizeof(crystallinetoken));	7
(!token)	14
token->token_id	14
token_id;	49
(token_str)	7
strncpy(token->token_str,	14
63);	14
token->token_str[63]	7
'\0';	294
token->prime	7
prime;	70
token->is_root	7
crystalline_is_prime(prime);	7
crystalline_factorize(prime,	7
token->prime_factors,	7
&token->num_factors);	7
coordinates	210
token->lattice_coords[i].integer_part	7
token->lattice_coords[i].fractional_part	7
#pragma	21
gcc	21
diagnostic	21
push	7
ignored	7
"-wstringop-overflow"	7
crystalline_compute_ulam_position(prime,	7
token->lattice_coords,	14
pop	7
(token->is_root)	7
token->root_token_id	14
token->num_neighbors	7
token->usage_count	7
token->root_score	7
1.0;	168
crystalline_token_free(crystallinetoken*	7
(token->lattice_coords[i].integer_part)	7
big_free(token->lattice_coords[i].integer_part);	7
free(token->lattice_coords[i].integer_part);	7
(token->lattice_coords[i].fractional_part)	7
big_free(token->lattice_coords[i].fractional_part);	7
free(token->lattice_coords[i].fractional_part);	7
free(token);	7
crystalline_lattice_distance(const	7
pos1[3],	7
pos2[3],	7
distance)	14
(!pos1	21
!pos2	7
!distance)	7
distance	336
(!distance->integer_part)	7
distance->integer_part	7
big_init(distance->integer_part);	7
(!distance->fractional_part)	7
distance->fractional_part	7
big_init(distance->fractional_part);	7
diff[3];	7
diff_sq[3];	7
sum;	175
diff[i].integer_part	7
diff[i].fractional_part	7
big_init(diff[i].integer_part);	7
big_init(diff[i].fractional_part);	7
diff_sq[i].integer_part	7
diff_sq[i].fractional_part	7
big_init(diff_sq[i].integer_part);	7
big_init(diff_sq[i].fractional_part);	7
sum.integer_part	7
sum.fractional_part	7
big_init(sum.integer_part);	7
big_init(sum.fractional_part);	7
big_fixed_sub(&diff[i],	7
&pos1[i],	7
&pos2[i]);	7
big_fixed_mul(&diff_sq[i],	7
&diff[i],	7
&diff[i]);	7
big_fixed_from_int(&sum,	7
temp;	301
temp.integer_part	7
temp.fractional_part	7
big_init(temp.integer_part);	7
big_init(temp.fractional_part);	7
big_fixed_add(&temp,	7
&sum,	7
&diff_sq[i]);	7
big_free(sum.integer_part);	14
big_free(sum.fractional_part);	14
free(sum.integer_part);	14
free(sum.fractional_part);	14
sum	777
sqrt(sum)	7
first	350
convert	329
big_sqrt	7
sum_int	7
big_init(sum_int);	7
big_fixed_to_bigint_rounded(sum_int,	7
&sum);	7
sqrt	7
big_sqrt(distance,	7
sum_int,	7
big_free(sum_int);	7
free(sum_int);	7
big_free(diff[i].integer_part);	7
big_free(diff[i].fractional_part);	7
free(diff[i].integer_part);	7
free(diff[i].fractional_part);	7
big_free(diff_sq[i].integer_part);	7
big_free(diff_sq[i].fractional_part);	7
free(diff_sq[i].integer_part);	7
free(diff_sq[i].fractional_part);	7
crystalline_prime_similarity(uint64_t	7
prime1,	56
prime2,	21
similarity)	7
(!similarity)	7
(!similarity->integer_part)	7
similarity->integer_part	7
big_init(similarity->integer_part);	7
(!similarity->fractional_part)	7
similarity->fractional_part	7
big_init(similarity->fractional_part);	7
(prime1	56
prime2)	84
big_fixed_from_double(similarity,	21
1.0);	35
a	1050
b	686
prime2;	21
(b	119
!=	1337
temp	203
b;	259
gcd	196
a;	63
(gcd	56
0.5);	21
double	2968
sim	14
(double)gcd;	7
(sim	7
1.0)	63
sim);	7
crystalline_phase_alignment(uint64_t	7
alignment)	7
(!alignment)	7
(!alignment->integer_part)	7
alignment->integer_part	7
big_init(alignment->integer_part);	7
(!alignment->fractional_part)	7
alignment->fractional_part	7
big_init(alignment->fractional_part);	7
phase_diff	21
π	77
big_pi	14
pi;	35
pi.integer_part	7
pi.fractional_part	7
big_init(pi.integer_part);	7
big_init(pi.fractional_part);	7
pi.scale_bits	7
256;	70
pi.negative	7
big_pi(&pi,	7
two_pi;	49
two_pi.integer_part	7
two_pi.fractional_part	7
big_init(two_pi.integer_part);	7
big_init(two_pi.fractional_part);	7
two_pi.scale_bits	7
two_pi.negative	7
two;	63
two.integer_part	7
two.fractional_part	7
big_init(two.integer_part);	7
big_init(two.fractional_part);	7
two.scale_bits	7
two.negative	7
big_fixed_from_int(&two,	7
2);	175
big_fixed_mul(&two_pi,	7
&pi,	7
&two);	21
int64_t	231
diff	238
(int64_t)prime1	7
(int64_t)prime2;	7
diff_fixed;	7
diff_fixed.integer_part	7
diff_fixed.fractional_part	7
big_init(diff_fixed.integer_part);	7
big_init(diff_fixed.fractional_part);	7
diff_fixed.scale_bits	7
diff_fixed.negative	7
(diff	70
?	1064
:	1064
big_fixed_from_int(&diff_fixed,	7
-diff	7
diff);	21
sum_primes	7
prime1	28
sum_fixed;	7
sum_fixed.integer_part	7
sum_fixed.fractional_part	7
big_init(sum_fixed.integer_part);	7
big_init(sum_fixed.fractional_part);	7
sum_fixed.scale_bits	7
sum_fixed.negative	7
big_fixed_from_int(&sum_fixed,	7
sum_primes);	7
numerator;	14
numerator.integer_part	7
numerator.fractional_part	7
big_init(numerator.integer_part);	7
big_init(numerator.fractional_part);	7
numerator.scale_bits	7
numerator.negative	7
big_fixed_mul(&numerator,	7
&two_pi,	7
&diff_fixed);	7
numerator	28
phase_diff;	7
phase_diff.integer_part	7
phase_diff.fractional_part	7
big_init(phase_diff.integer_part);	7
big_init(phase_diff.fractional_part);	7
phase_diff.scale_bits	7
phase_diff.negative	7
big_fixed_div(&phase_diff,	7
&numerator,	14
&sum_fixed);	7
cos(phase_diff)	7
cos_phase;	7
cos_phase.integer_part	7
cos_phase.fractional_part	7
big_init(cos_phase.integer_part);	7
big_init(cos_phase.fractional_part);	7
cos_phase.scale_bits	7
cos_phase.negative	7
big_cos(&cos_phase,	7
&phase_diff,	7
(1	119
cos(phase_diff))	14
one;	98
one.integer_part	7
one.fractional_part	7
big_init(one.integer_part);	7
big_init(one.fractional_part);	7
one.scale_bits	7
one.negative	7
big_fixed_from_int(&one,	7
one_plus_cos;	7
one_plus_cos.integer_part	7
one_plus_cos.fractional_part	7
big_init(one_plus_cos.integer_part);	7
big_init(one_plus_cos.fractional_part);	7
one_plus_cos.scale_bits	7
one_plus_cos.negative	7
big_fixed_add(&one_plus_cos,	7
&one,	133
&cos_phase);	7
alignment	28
big_fixed_div(alignment,	7
&one_plus_cos,	7
big_free(one_plus_cos.integer_part);	7
free(one_plus_cos.integer_part);	7
big_free(one_plus_cos.fractional_part);	7
free(one_plus_cos.fractional_part);	7
big_free(one.integer_part);	7
free(one.integer_part);	7
big_free(one.fractional_part);	7
free(one.fractional_part);	7
big_free(cos_phase.integer_part);	7
free(cos_phase.integer_part);	7
big_free(cos_phase.fractional_part);	7
free(cos_phase.fractional_part);	7
big_free(phase_diff.integer_part);	7
free(phase_diff.integer_part);	7
big_free(phase_diff.fractional_part);	7
free(phase_diff.fractional_part);	7
big_free(numerator.integer_part);	7
free(numerator.integer_part);	7
big_free(numerator.fractional_part);	7
free(numerator.fractional_part);	7
big_free(sum_fixed.integer_part);	7
free(sum_fixed.integer_part);	7
big_free(sum_fixed.fractional_part);	7
free(sum_fixed.fractional_part);	7
big_free(diff_fixed.integer_part);	7
free(diff_fixed.integer_part);	7
big_free(diff_fixed.fractional_part);	7
free(diff_fixed.fractional_part);	7
big_free(two.integer_part);	7
free(two.integer_part);	7
big_free(two.fractional_part);	7
free(two.fractional_part);	7
big_free(two_pi.integer_part);	7
free(two_pi.integer_part);	7
big_free(two_pi.fractional_part);	7
free(two_pi.fractional_part);	7
big_free(pi.integer_part);	7
free(pi.integer_part);	7
big_free(pi.fractional_part);	7
free(pi.fractional_part);	7
attention	770
mechanism	21
multi-head	35
self-attention	7
<immintrin.h>	21
"../include/cllm.h"	133
"../include/cllm_inference.h"	70
"../include/cllm_simd_utils.h"	21
"../include/cllm_cache.h"	21
forward	301
