<PAD>	0
<UNK>	0
<BOS>	0
<EOS>	0
<MASK>	0
/*	137
*	3651
cllm	54
lattice	131
conversion	13
utilities	14
*/	666
#include	545
"../../include/cllm.h"	1
"../../include/bigfixed_core.h"	2
"../../include/bigint_core.h"	3
"../../include/prime_types.h"	1
<stdlib.h>	76
<string.h>	78
<stdio.h>	68
"../include/prime_float_math.h"	33
void	519
cllm_float_to_bigfixed(bigfixed*	1
output,	23
float*	316
input,	25
int	955
n,	52
precision)	15
{	4437
(void)precision;	4
unused	11
parameter	12
-	792
kept	2
for	1523
api	10
compatibility	7
if	3302
(!output	3
||	905
!input	12
n	139
<=	257
0)	537
return;	510
(int	499
i	1418
=	6441
0;	1626
<	1339
n;	70
i++)	629
big_fixed_from_double(&output[i],	1
(double)input[i]);	1
}	4419
cllm_bigfixed_to_float(float*	1
bigfixed*	15
n)	74
output[i]	7
(float)big_fixed_to_double(&input[i]);	1
cllm_embeddings_to_basis(bigfixed**	1
basis,	19
embeddings,	5
dim,	18
(!basis	4
!embeddings	1
0	220
dim	81
cllm_float_to_bigfixed(basis[i],	1
&embeddings[i	1
dim],	3
precision);	13
cllm_basis_to_embeddings(float*	1
bigfixed**	15
dim)	24
(!embeddings	3
!basis	6
cllm_bigfixed_to_float(&embeddings[i	1
basis[i],	1
dim);	23
cllm_alloc_bigfixed_basis(int	1
(n	86
return	2064
null;	455
basis	60
(bigfixed**)malloc(n	5
sizeof(bigfixed*));	6
(!basis)	2
basis[i]	2
(bigfixed*)malloc(dim	4
sizeof(bigfixed));	10
(!basis[i])	1
j	232
i;	69
j++)	103
free(basis[j]);	1
free(basis);	2
d	126
dim;	58
d++)	50
big_fixed_from_int(&basis[i][d],	1
0);	164
basis;	3
cllm_free_bigfixed_basis(bigfixed**	1
(basis[i])	1
free(basis[i]);	1
cllm_embedding_to_bigfixed(bigfixed*	1
embedding,	17
cllm_float_to_bigfixed(output,	1
cllm_bigfixed_to_embedding(float*	1
vector,	3
cllm_bigfixed_to_float(embedding,	1
float	675
cllm_test_conversion_accuracy(float*	1
(!input	3
-1.0f;	7
bigfixed	213
(bigfixed*)malloc(n	5
output	85
(float*)malloc(n	1
sizeof(float));	229
(!bigfixed	1
!output)	8
(bigfixed)	1
free(bigfixed);	2
(output)	5
free(output);	13
cllm_float_to_bigfixed(bigfixed,	1
cllm_bigfixed_to_float(output,	1
bigfixed,	1
n);	24
max_error	4
0.0f;	233
error	8
prime_fabsf(output[i]	1
input[i]);	1
(error	7
>	417
max_error)	1
error;	1
max_error;	2
cllm_print_conversion_stats(float*	1
cllm_test_conversion_accuracy(input,	1
printf("conversion	1
statistics:\n");	12
printf("	241
elements:	1
%d\n",	82
precision:	7
%d	59
bits\n",	1
max	24
error:	3
%.10e\n",	1
max_error);	1
(max_error	3
1e-6f)	3
status:	4
excellent	1
1e-6)\n");	1
else	190
1e-4f)	1
good	4
1e-4)\n");	1
1e-2f)	1
acceptable	1
1e-2)\n");	2
warning	10
>=	182
pure	10
crystalline	58
embeddings	57
implementation	45
implements	17
crystallineembeddings	3
with	158
lll-reduced	2
exact	5
token	118
positions,	1
and	167
morphology	5
graph.	1
implementation:	5
uses	41
only	14
arbitrary	15
precision	49
mathematics.	2
no	46
external	7
math	9
libraries	2
(math.h,	2
gmp,	2
etc.)	5
"cllm_pure_crystalline.h"	3
helper	21
function	33
to	537
allocate	140
matrix	50
static	227
allocate_bigfixed_matrix(uint32_t	1
rows,	4
uint32_t	310
cols,	1
(bigfixed**)malloc(rows	1
(!matrix)	2
(uint32_t	270
rows;	10
matrix[i]	1
(bigfixed*)malloc(cols	1
(!matrix[i])	1
//	3757
cleanup	43
on	67
failure	9
free(matrix[j]);	1
free(matrix);	3
initialize	182
each	45
cols;	11
bigint	226
structures	9
matrix[i][j].integer_part	1
(bigint*)malloc(sizeof(bigint));	55
matrix[i][j].fractional_part	1
(!matrix[i][j].integer_part	1
!matrix[i][j].fractional_part)	1
k	60
k++)	13
l	10
l++)	4
big_free(matrix[k][l].integer_part);	1
free(matrix[k][l].integer_part);	1
big_free(matrix[k][l].fractional_part);	1
free(matrix[k][l].fractional_part);	1
free(matrix[k]);	1
(j	4
j;	18
big_free(matrix[i][l].integer_part);	1
free(matrix[i][l].integer_part);	1
big_free(matrix[i][l].fractional_part);	1
free(matrix[i][l].fractional_part);	1
free(matrix[i]);	2
big_init(matrix[i][j].integer_part);	1
big_init(matrix[i][j].fractional_part);	1
matrix[i][j].scale_bits	1
precision;	8
matrix[i][j].negative	1
matrix;	1
free	116
free_bigfixed_matrix(bigfixed**	1
matrix,	3
cols)	3
(matrix[i])	1
(matrix[i][j].integer_part)	1
big_free(matrix[i][j].integer_part);	1
free(matrix[i][j].integer_part);	1
(matrix[i][j].fractional_part)	1
big_free(matrix[i][j].fractional_part);	1
free(matrix[i][j].fractional_part);	1
create	121
new	24
structure	49
crystallineembeddings*	2
crystalline_embeddings_create(uint32_t	1
vocab_size,	13
lattice_dim)	1
(vocab_size	2
==	584
lattice_dim	2
fprintf(stderr,	292
"error:	164
vocab_size	54
must	30
be	60
0\n");	20
(crystallineembeddings*)malloc(sizeof(crystallineembeddings));	1
(!embeddings)	4
failed	71
crystallineembeddings\n");	1
embeddings->vocab_size	1
vocab_size;	45
embeddings->lattice_dim	3
lattice_dim;	1
embeddings->basis_optimized	1
false;	303
embeddings->optimization_epoch	1
embeddings->total_lookups	1
embeddings->cache_hits	1
embeddings->avg_lookup_time	1
0.0;	111
(identity	1
initially)	1
embeddings->lattice_basis	1
allocate_bigfixed_matrix(lattice_dim,	2
lattice_dim,	16
256);	7
(!embeddings->lattice_basis)	1
free(embeddings);	9
inverse	30
embeddings->inverse_basis	1
(!embeddings->inverse_basis)	1
free_bigfixed_matrix(embeddings->lattice_basis,	8
lattice_dim);	17
array	59
embeddings->tokens	1
(crystallinetoken**)calloc(vocab_size,	1
sizeof(crystallinetoken*));	1
(!embeddings->tokens)	1
free_bigfixed_matrix(embeddings->inverse_basis,	7
positions	8
embeddings->token_positions	1
allocate_bigfixed_matrix(vocab_size,	1
(!embeddings->token_positions)	1
free(embeddings->tokens);	6
primes	30
embeddings->token_primes	1
(uint64_t*)calloc(vocab_size,	1
sizeof(uint64_t));	5
(!embeddings->token_primes)	1
free_bigfixed_matrix(embeddings->token_positions,	5
graph	2
embeddings->morphology_graph	1
(uint32_t**)malloc(vocab_size	1
sizeof(uint32_t*));	1
(!embeddings->morphology_graph)	1
free(embeddings->token_primes);	4
embeddings->morphology_graph[i]	1
(uint32_t*)calloc(max_derived_tokens,	1
sizeof(uint32_t));	40
(!embeddings->morphology_graph[i])	1
free(embeddings->morphology_graph[j]);	1
free(embeddings->morphology_graph);	3
counts	3
embeddings->morphology_counts	1
(uint8_t*)calloc(vocab_size,	1
sizeof(uint8_t));	1
(!embeddings->morphology_counts)	1
free(embeddings->morphology_graph[i]);	2
embeddings;	1
crystalline_embeddings_free(crystallineembeddings*	1
embeddings)	2
(embeddings->morphology_counts)	1
free(embeddings->morphology_counts);	1
(embeddings->morphology_graph)	1
embeddings->vocab_size;	1
(embeddings->morphology_graph[i])	1
(embeddings->token_primes)	1
(embeddings->token_positions)	1
embeddings->vocab_size,	1
embeddings->lattice_dim);	3
tokens	86
(but	1
don't	12
the	154
objects	1
themselves	1
they're	4
owned	3
by	60
caller)	1
(embeddings->tokens)	1
(embeddings->inverse_basis)	1
embeddings->lattice_dim,	2
(embeddings->lattice_basis)	1
add	61
bool	164
crystalline_embeddings_add_token(crystallineembeddings*	1
crystallinetoken*	4
token)	6
!token)	3
null	32
or	45
token\n");	1
(token->token_id	1
embeddings->vocab_size)	3
token_id	29
%u	30
%u\n",	59
token->token_id,	1
embeddings->vocab_size);	3
store	18
pointer	8
embeddings->tokens[token->token_id]	1
token;	6
prime	189
embeddings->token_primes[token->token_id]	1
token->prime;	1
copy	53
position	64
(from	2
ulam	21
spiral	35
coordinates)	1
&&	287
3;	44
big_fixed_assign(&embeddings->token_positions[token->token_id][i],	1
&token->lattice_coords[i]);	1
true;	142
get	98
from	135
crystalline_embeddings_get_token(crystallineembeddings*	1
token_id)	6
embeddings\n");	4
(token_id	20
token_id,	18
embeddings->tokens[token_id];	1
identity	11
crystalline_initialize_basis(crystallineembeddings*	1
set	52
embeddings->lattice_dim;	4
(i	56
j)	8
1.0	24
big_from_int(embeddings->lattice_basis[i][j].integer_part,	2
1);	216
big_from_int(embeddings->lattice_basis[i][j].fractional_part,	2
0.0	14
embeddings->lattice_basis[i][j].negative	1
(same	3
as	33
identity)	1
big_from_int(embeddings->inverse_basis[i][j].integer_part,	2
big_from_int(embeddings->inverse_basis[i][j].fractional_part,	2
embeddings->inverse_basis[i][j].negative	1
compute	173
(currently	1
just	15
copies	2
token's	4
lattice_coords)	1
crystalline_compute_token_position(crystallineembeddings*	1
position[3])	1
!position)	1
position\n");	4
stored	7
big_fixed_assign(&position[i],	1
&embeddings->token_positions[token_id][i]);	1
operations	36
"../../include/cllm_pure_crystalline.h"	1
"../../include/prime_math_custom.h"	1
"../../include/prime_bigint_transcendental.h"	1
"../../include/bigfixed_constants.h"	1
#define	50
prime_cache_size	2
10000	3
uint64_t	348
prime_cache[prime_cache_size];	2
prime_cache_initialized	4
integer	39
square	9
root	35
using	96
newton's	5
method	3
floating	1
point	10
isqrt(uint64_t	2
3)	10
1;	271
initial	8
guess	6
x	168
y	32
(x	92
+	874
1)	152
/	508
2;	91
method:	3
x_new	2
n/x)	3
2	96
while	149
(y	17
x)	71
y;	20
x;	31
init_prime_cache(void)	2
(prime_cache_initialized)	2
prime_cache[0]	2
prime_cache[1]	2
count	109
candidate	21
5;	13
(count	17
prime_cache_size)	5
is_prime	16
sqrt_cand	2
isqrt(candidate);	1
prime_cache[i]	5
sqrt_cand;	2
(candidate	3
%	147
break;	186
(is_prime)	6
prime_cache[count++]	2
candidate;	12
+=	394
crystalline_is_prime(uint64_t	1
2)	62
sqrt_n	3
isqrt(n);	2
(uint64_t	42
sqrt_n;	3
crystalline_get_nth_prime(uint32_t	1
init_prime_cache();	6
prime_cache[n];	2
prime_cache_size;	6
prime_cache[prime_cache_size	3
1]	24
(crystalline_is_prime(candidate))	1
count++;	18
crystalline_factorize(uint64_t	1
number,	2
uint64_t*	21
factors,	3
uint8_t*	1
num_factors)	2
(!factors	1
!num_factors)	1
*num_factors	7
(number	5
(crystalline_is_prime(number))	1
factors[0]	1
number;	3
max_prime_factors)	2
factors[(*num_factors)++]	3
number	100
/=	42
max_prime_factors;	1
1	96
crystalline_compute_ulam_position(uint64_t	1
prime,	34
coords[3],	2
(!coords)	3
needed	25
(!coords[i].integer_part)	1
coords[i].integer_part	1
big_init(coords[i].integer_part);	1
(!coords[i].fractional_part)	1
coords[i].fractional_part	1
big_init(coords[i].fractional_part);	1
coords[i].scale_bits	1
coords[i].negative	1
find	64
index	29
prime_index	12
(prime_cache[i]	3
prime)	35
not	55
in	231
cache,	4
estimate	17
(prime_index	2
1])	1
approximate:	1
≈	28
ln(prime)	1
simplicity,	2
use	125
10	12
rough	5
(uint32_t)(prime	3
10);	5
bigint*	31
idx	26
big_init(idx);	1
big_from_int(idx,	1
prime_index);	2
radius	30
sqrt(prime_index)	1
radius;	2
radius.integer_part	1
radius.fractional_part	1
big_init(radius.integer_part);	1
big_init(radius.fractional_part);	1
radius.scale_bits	1
radius.negative	1
big_sqrt(&radius,	1
idx,	1
angle	55
golden_angle	13
2π	7
φ²	2
2.39996322972865332	1
radians	10
golden_angle;	3
golden_angle.integer_part	1
golden_angle.fractional_part	1
big_init(golden_angle.integer_part);	1
big_init(golden_angle.fractional_part);	1
golden_angle.scale_bits	1
golden_angle.negative	1
big_fixed_from_double(&golden_angle,	1
2.39996322972865332);	1
angle;	7
angle.integer_part	1
angle.fractional_part	1
big_init(angle.integer_part);	1
big_init(angle.fractional_part);	1
angle.scale_bits	1
angle.negative	1
idx_fixed;	1
idx_fixed.integer_part	1
idx_fixed.fractional_part	1
big_init(idx_fixed.integer_part);	1
big_init(idx_fixed.fractional_part);	1
idx_fixed.scale_bits	1
idx_fixed.negative	1
big_fixed_from_int(&idx_fixed,	1
big_fixed_mul(&angle,	1
&golden_angle,	1
&idx_fixed);	1
cos(angle)	1
cos_angle;	1
cos_angle.integer_part	1
cos_angle.fractional_part	1
big_init(cos_angle.integer_part);	1
big_init(cos_angle.fractional_part);	1
cos_angle.scale_bits	1
cos_angle.negative	1
big_cos(&cos_angle,	1
&angle,	3
big_fixed_mul(&coords[0],	1
&radius,	2
&cos_angle);	1
sin(angle)	1
sin_angle;	1
sin_angle.integer_part	1
sin_angle.fractional_part	1
big_init(sin_angle.integer_part);	1
big_init(sin_angle.fractional_part);	1
sin_angle.scale_bits	1
sin_angle.negative	1
big_sin(&sin_angle,	1
big_fixed_mul(&coords[1],	1
&sin_angle);	1
z	10
ln(prime	1
prime_plus_1	1
big_init(prime_plus_1);	1
big_from_int(prime_plus_1,	1
big_ln(&coords[2],	1
prime_plus_1,	1
temporary	12
bigfixed/bigint	1
big_free(prime_plus_1);	1
free(prime_plus_1);	1
big_free(sin_angle.integer_part);	1
free(sin_angle.integer_part);	1
big_free(sin_angle.fractional_part);	1
free(sin_angle.fractional_part);	1
big_free(cos_angle.integer_part);	1
free(cos_angle.integer_part);	1
big_free(cos_angle.fractional_part);	1
free(cos_angle.fractional_part);	1
big_free(idx_fixed.integer_part);	1
free(idx_fixed.integer_part);	1
big_free(idx_fixed.fractional_part);	1
free(idx_fixed.fractional_part);	1
big_free(angle.integer_part);	1
free(angle.integer_part);	1
big_free(angle.fractional_part);	1
free(angle.fractional_part);	1
big_free(golden_angle.integer_part);	1
free(golden_angle.integer_part);	1
big_free(golden_angle.fractional_part);	1
free(golden_angle.fractional_part);	1
big_free(radius.integer_part);	1
free(radius.integer_part);	1
big_free(radius.fractional_part);	1
free(radius.fractional_part);	1
big_free(idx);	1
free(idx);	1
crystalline_token_create(uint32_t	1
const	361
char*	181
token_str,	4
(crystallinetoken*)calloc(1,	1
sizeof(crystallinetoken));	1
(!token)	2
token->token_id	2
token_id;	7
(token_str)	1
strncpy(token->token_str,	2
63);	2
token->token_str[63]	1
'\0';	42
token->prime	1
prime;	10
token->is_root	1
crystalline_is_prime(prime);	1
crystalline_factorize(prime,	1
token->prime_factors,	1
&token->num_factors);	1
coordinates	30
token->lattice_coords[i].integer_part	1
token->lattice_coords[i].fractional_part	1
#pragma	3
gcc	3
diagnostic	3
push	1
ignored	1
"-wstringop-overflow"	1
crystalline_compute_ulam_position(prime,	1
token->lattice_coords,	2
pop	1
(token->is_root)	1
token->root_token_id	2
token->num_neighbors	1
token->usage_count	1
token->root_score	1
1.0;	24
crystalline_token_free(crystallinetoken*	1
(token->lattice_coords[i].integer_part)	1
big_free(token->lattice_coords[i].integer_part);	1
free(token->lattice_coords[i].integer_part);	1
(token->lattice_coords[i].fractional_part)	1
big_free(token->lattice_coords[i].fractional_part);	1
free(token->lattice_coords[i].fractional_part);	1
free(token);	1
crystalline_lattice_distance(const	1
pos1[3],	1
pos2[3],	1
distance)	2
(!pos1	3
!pos2	1
!distance)	1
distance	48
(!distance->integer_part)	1
distance->integer_part	1
big_init(distance->integer_part);	1
(!distance->fractional_part)	1
distance->fractional_part	1
big_init(distance->fractional_part);	1
diff[3];	1
diff_sq[3];	1
sum;	25
diff[i].integer_part	1
diff[i].fractional_part	1
big_init(diff[i].integer_part);	1
big_init(diff[i].fractional_part);	1
diff_sq[i].integer_part	1
diff_sq[i].fractional_part	1
big_init(diff_sq[i].integer_part);	1
big_init(diff_sq[i].fractional_part);	1
sum.integer_part	1
sum.fractional_part	1
big_init(sum.integer_part);	1
big_init(sum.fractional_part);	1
big_fixed_sub(&diff[i],	1
&pos1[i],	1
&pos2[i]);	1
big_fixed_mul(&diff_sq[i],	1
&diff[i],	1
&diff[i]);	1
big_fixed_from_int(&sum,	1
temp;	43
temp.integer_part	1
temp.fractional_part	1
big_init(temp.integer_part);	1
big_init(temp.fractional_part);	1
big_fixed_add(&temp,	1
&sum,	1
&diff_sq[i]);	1
big_free(sum.integer_part);	2
big_free(sum.fractional_part);	2
free(sum.integer_part);	2
free(sum.fractional_part);	2
sum	112
sqrt(sum)	1
first	51
convert	47
big_sqrt	1
sum_int	1
big_init(sum_int);	1
big_fixed_to_bigint_rounded(sum_int,	1
&sum);	1
sqrt	1
big_sqrt(distance,	1
sum_int,	1
big_free(sum_int);	1
free(sum_int);	1
big_free(diff[i].integer_part);	1
big_free(diff[i].fractional_part);	1
free(diff[i].integer_part);	1
free(diff[i].fractional_part);	1
big_free(diff_sq[i].integer_part);	1
big_free(diff_sq[i].fractional_part);	1
free(diff_sq[i].integer_part);	1
free(diff_sq[i].fractional_part);	1
crystalline_prime_similarity(uint64_t	1
prime1,	8
prime2,	3
similarity)	1
(!similarity)	1
(!similarity->integer_part)	1
similarity->integer_part	1
big_init(similarity->integer_part);	1
(!similarity->fractional_part)	1
similarity->fractional_part	1
big_init(similarity->fractional_part);	1
(prime1	8
prime2)	12
big_fixed_from_double(similarity,	3
1.0);	5
a	157
b	98
prime2;	3
(b	17
!=	190
temp	29
b;	37
gcd	28
a;	9
(gcd	8
0.5);	3
double	424
sim	2
(double)gcd;	1
(sim	1
1.0)	9
sim);	1
crystalline_phase_alignment(uint64_t	1
alignment)	1
(!alignment)	1
(!alignment->integer_part)	1
alignment->integer_part	1
big_init(alignment->integer_part);	1
(!alignment->fractional_part)	1
alignment->fractional_part	1
big_init(alignment->fractional_part);	1
phase_diff	3
π	11
big_pi	2
pi;	5
pi.integer_part	1
pi.fractional_part	1
big_init(pi.integer_part);	1
big_init(pi.fractional_part);	1
pi.scale_bits	1
256;	10
pi.negative	1
big_pi(&pi,	1
two_pi;	7
two_pi.integer_part	1
two_pi.fractional_part	1
big_init(two_pi.integer_part);	1
big_init(two_pi.fractional_part);	1
two_pi.scale_bits	1
two_pi.negative	1
two;	9
two.integer_part	1
two.fractional_part	1
big_init(two.integer_part);	1
big_init(two.fractional_part);	1
two.scale_bits	1
two.negative	1
big_fixed_from_int(&two,	1
2);	25
big_fixed_mul(&two_pi,	1
&pi,	1
&two);	3
int64_t	33
diff	34
(int64_t)prime1	1
(int64_t)prime2;	1
diff_fixed;	1
diff_fixed.integer_part	1
diff_fixed.fractional_part	1
big_init(diff_fixed.integer_part);	1
big_init(diff_fixed.fractional_part);	1
diff_fixed.scale_bits	1
diff_fixed.negative	1
(diff	10
?	158
:	158
big_fixed_from_int(&diff_fixed,	1
-diff	1
diff);	3
sum_primes	1
prime1	4
sum_fixed;	1
sum_fixed.integer_part	1
sum_fixed.fractional_part	1
big_init(sum_fixed.integer_part);	1
big_init(sum_fixed.fractional_part);	1
sum_fixed.scale_bits	1
sum_fixed.negative	1
big_fixed_from_int(&sum_fixed,	1
sum_primes);	1
numerator;	2
numerator.integer_part	1
numerator.fractional_part	1
big_init(numerator.integer_part);	1
big_init(numerator.fractional_part);	1
numerator.scale_bits	1
numerator.negative	1
big_fixed_mul(&numerator,	1
&two_pi,	1
&diff_fixed);	1
numerator	4
phase_diff;	1
phase_diff.integer_part	1
phase_diff.fractional_part	1
big_init(phase_diff.integer_part);	1
big_init(phase_diff.fractional_part);	1
phase_diff.scale_bits	1
phase_diff.negative	1
big_fixed_div(&phase_diff,	1
&numerator,	2
&sum_fixed);	1
cos(phase_diff)	1
cos_phase;	1
cos_phase.integer_part	1
cos_phase.fractional_part	1
big_init(cos_phase.integer_part);	1
big_init(cos_phase.fractional_part);	1
cos_phase.scale_bits	1
cos_phase.negative	1
big_cos(&cos_phase,	1
&phase_diff,	1
(1	19
cos(phase_diff))	2
one;	14
one.integer_part	1
one.fractional_part	1
big_init(one.integer_part);	1
big_init(one.fractional_part);	1
one.scale_bits	1
one.negative	1
big_fixed_from_int(&one,	1
one_plus_cos;	1
one_plus_cos.integer_part	1
one_plus_cos.fractional_part	1
big_init(one_plus_cos.integer_part);	1
big_init(one_plus_cos.fractional_part);	1
one_plus_cos.scale_bits	1
one_plus_cos.negative	1
big_fixed_add(&one_plus_cos,	1
&one,	19
&cos_phase);	1
alignment	4
big_fixed_div(alignment,	1
&one_plus_cos,	1
big_free(one_plus_cos.integer_part);	1
free(one_plus_cos.integer_part);	1
big_free(one_plus_cos.fractional_part);	1
free(one_plus_cos.fractional_part);	1
big_free(one.integer_part);	1
free(one.integer_part);	1
big_free(one.fractional_part);	1
free(one.fractional_part);	1
big_free(cos_phase.integer_part);	1
free(cos_phase.integer_part);	1
big_free(cos_phase.fractional_part);	1
free(cos_phase.fractional_part);	1
big_free(phase_diff.integer_part);	1
free(phase_diff.integer_part);	1
big_free(phase_diff.fractional_part);	1
free(phase_diff.fractional_part);	1
big_free(numerator.integer_part);	1
free(numerator.integer_part);	1
big_free(numerator.fractional_part);	1
free(numerator.fractional_part);	1
big_free(sum_fixed.integer_part);	1
free(sum_fixed.integer_part);	1
big_free(sum_fixed.fractional_part);	1
free(sum_fixed.fractional_part);	1
big_free(diff_fixed.integer_part);	1
free(diff_fixed.integer_part);	1
big_free(diff_fixed.fractional_part);	1
free(diff_fixed.fractional_part);	1
big_free(two.integer_part);	1
free(two.integer_part);	1
big_free(two.fractional_part);	1
free(two.fractional_part);	1
big_free(two_pi.integer_part);	1
free(two_pi.integer_part);	1
big_free(two_pi.fractional_part);	1
free(two_pi.fractional_part);	1
big_free(pi.integer_part);	1
free(pi.integer_part);	1
big_free(pi.fractional_part);	1
free(pi.fractional_part);	1
attention	110
mechanism	3
multi-head	5
self-attention	1
<immintrin.h>	4
"../include/cllm.h"	19
"../include/cllm_inference.h"	10
"../include/cllm_simd_utils.h"	3
"../include/cllm_cache.h"	3
forward	44
declarations	7
missing	3
functions	68
prime_exp(double	3
x);	36
prime_sqrt(double	3
/**	529
softmax	22
@param	328
input/output	16
size	127
softmax(float*	1
x,	60
size)	41
(!x	11
numerical	21
stability	23
max_val	14
x[0];	1
size;	55
(x[i]	6
max_val)	4
x[i];	4
exp	10
x[i]	16
prime_exp(x[i]	1
max_val);	3
normalize	36
(sum	4
1e-8f)	12
scaled	3
dot-product	2
single	15
head	25
attention(q,	1
k,	30
v)	5
softmax(q	1
k^t	1
sqrt(d_k))	1
v	69
query	24
vector	50
[head_dim]	6
keys	6
key	19
[seq_len	15
head_dim]	2
values	25
value	55
head_dim	65
dimension	50
per	33
seq_len	98
sequence	42
length	21
scaled_dot_product_attention(float*	1
query,	3
keys,	3
values,	6
head_dim,	6
seq_len)	13
(!query	2
!keys	5
!values	3
!output	12
scale	60
1.0f	34
prime_sqrt((float)head_dim);	1
scores	9
(float*)malloc(seq_len	8
(!scores)	1
simd	8
dot	30
product:	3
scores[i]	4
·	1
keys[i]	1
sqrt(head_dim)	1
seq_len;	65
prefetch	5
next	32
better	8
cache	70
utilization	5
prefetch_read(&keys[(i	1
head_dim]);	2
dot_product(query,	1
&keys[i	2
head_dim],	1
head_dim)	2
scale;	43
apply	99
weights	68
softmax(scores,	1
seq_len);	12
weighted	2
of	161
memset(output,	4
0,	123
prefetch_read(&values[(i	1
values[i]	2
score	9
scores[i];	2
j_vec	2
(head_dim	1
8)	26
8;	15
__m256	32
vscore	1
_mm256_set1_ps(score);	1
vectorized	12
accumulation	30
(;	18
j_vec;	2
vval	1
_mm256_loadu_ps(&values[i	1
j]);	8
vout	2
_mm256_loadu_ps(&output[j]);	1
_mm256_fmadd_ps(vscore,	1
vval,	1
vout);	2
_mm256_storeu_ps(&output[j],	1
scalar	17
remainder	17
head_dim;	29
output[j]	2
values[i	1
j];	5
free(scores);	1
pass	59
layer	151
parameters	42
input	61
embedding_dim]	10
key_cache	2
cached	11
(can	2
null)	27
value_cache	2
cllm_attention_forward(attentionlayer*	1
layer,	12
key_cache,	3
value_cache,	3
(!layer	7
num_heads	16
layer->num_heads;	2
layer->head_dim;	4
embedding_dim	49
buffers	34
q,	22
projections	7
queries	5
(!queries	4
!values)	2
(queries)	1
free(queries);	6
(keys)	1
free(keys);	6
(values)	1
free(values);	6
project	11
directly	2
full	33
implementation,	6
these	6
would	27
separate	2
projection	13
matrices	5
(void)num_heads;	1
used	15
structure,	2
suppress	9
(void)head_dim;	1
pos	44
pos++)	12
input_vec	3
&input[pos	3
embedding_dim];	11
h	77
num_heads;	13
h++)	21
size_t	354
weight_idx	9
layer->query_lattice[weight_idx]	2
input_vec[h	9
i];	17
queries[pos	3
d]	13
layer->key_lattice[weight_idx]	2
keys[pos	3
layer->value_lattice[weight_idx]	2
values[pos	3
keys/values	1
available	15
(key_cache)	2
memcpy(keys,	1
(value_cache)	2
memcpy(values,	1
&queries[pos	2
head_dim];	10
head_keys	1
&keys[h	1
head_values	1
&values[h	1
head_output	2
&output[pos	2
this	86
scaled_dot_product_attention(query,	1
head_keys,	1
head_values,	1
head_output,	1
update	87
caches	2
provided	6
memcpy(key_cache,	1
memcpy(value_cache,	1
kv	1
(for	16
autoregressive	1
generation)	1
inf	13
inference	25
engine	6
state	81
layer_idx	3
cllm_multi_head_attention(cllminference*	1
inf,	7
layer_idx,	1
(!inf	7
(layer_idx	1
(int)inf->model->num_layers)	1
attentionlayer*	15
&inf->model->attention_layers[layer_idx];	1
calculate	71
offsets	1
inf->model->embedding_dim;	1
cache_offset	1
inf->kv_cache_size	1
embedding_dim;	24
inf->key_cache	1
&inf->key_cache[cache_offset]	1
inf->value_cache	1
&inf->value_cache[cache_offset]	1
cllm_attention_forward(layer,	1
heads	1
cllm_attention_init(attentionlayer*	1
num_heads,	2
layer->num_heads	3
layer->head_dim	1
weight_size	3
layer->query_lattice	2
(float*)calloc(weight_size,	6
layer->key_lattice	2
layer->value_lattice	2
(!layer->query_lattice	1
!layer->key_lattice	1
!layer->value_lattice)	1
cllm_attention_free(layer);	1
cllm_attention_free(attentionlayer*	1
layer)	4
(!layer)	2
(layer->query_lattice)	1
free(layer->query_lattice);	1
(layer->key_lattice)	1
free(layer->key_lattice);	1
(layer->value_lattice)	1
free(layer->value_lattice);	1
backward	45
training	151
computes	3
gradients	137
all	125
model	139
"cllm_training.h"	13
"cllm_utils.h"	2
zero	46
gradient	151
before	5
cllm_zero_all_gradients(cllmtraining*	1
training)	15
(!training	24
!training->model)	3
cllmmodel*	37
training->model;	12
main	16
buffer	39
(only	1
are	44
here)	1
(training->gradients)	4
embed_size	8
model->vocab_size	13
model->embedding_dim;	36
memset(training->gradients,	1
(training->attention_grads)	5
model->num_layers;	27
&model->attention_layers[i];	7
lattice_size	4
(training->attention_grads[i].query_lattice)	1
memset(training->attention_grads[i].query_lattice,	1
(training->attention_grads[i].key_lattice)	1
memset(training->attention_grads[i].key_lattice,	1
(training->attention_grads[i].value_lattice)	1
memset(training->attention_grads[i].value_lattice,	1
feed-forward	32
(training->ff_grads)	4
feedforwardlayer*	14
&model->ff_layers[i];	7
(training->ff_grads[i].w1_lattice)	1
memset(training->ff_grads[i].w1_lattice,	1
layer->input_dim	3
layer->hidden_dim	4
(training->ff_grads[i].w2_lattice)	1
memset(training->ff_grads[i].w2_lattice,	1
layer->output_dim	3
(training->ff_grads[i].bias1)	1
memset(training->ff_grads[i].bias1,	1
(training->ff_grads[i].bias2)	1
memset(training->ff_grads[i].bias2,	1
norm	64
(training->ln_grads)	2
cllmlayernorm*	7
&model->layer_norms[i];	2
(training->ln_grads[i].gamma)	1
memset(training->ln_grads[i].gamma,	1
layer->dim	2
(training->ln_grads[i].beta)	1
memset(training->ln_grads[i].beta,	1
through	20
normalization	20
backward_layer_norm(float*	1
grad_out,	4
grad_in,	3
ln,	7
grad_gamma,	1
grad_beta,	1
critical:	11
checks	6
(!grad_out	3
!grad_in	3
!x	5
!ln)	2
(!ln->gamma	2
!ln->beta)	2
layernorm	3
has	19
pointers!\n");	3
"	20
gamma=%p,	1
beta=%p\n",	1
(void*)ln->gamma,	1
(void*)ln->beta);	1
mean	27
variance	12
0.0f,	11
var	12
mean;	5
diff;	14
std	7
prime_sqrtf(var	4
1e-5f);	3
inv_std	4
std;	4
grad_var	6
grad_mean	6
x_norm	2
mean)	10
inv_std;	2
w.r.t.	23
gamma	14
beta	9
(grad_gamma)	1
grad_gamma[i]	1
grad_out[i]	3
x_norm;	2
(grad_beta)	1
grad_beta[i]	1
grad_out[i];	1
normalized	6
grad_x_norm	10
ln->gamma[i];	2
accumulate	30
-0.5f	2
-inv_std;	1
grad_in[i]	2
2.0f	36
backward_feed_forward(float*	1
ff,	1
grad_w1,	1
grad_w2,	1
grad_b1,	1
grad_b2)	1
!ff)	2
(!ff->w1_lattice	1
!ff->w2_lattice	1
!ff->bias1	1
!ff->bias2)	1
feedforwardlayer	1
w1_lattice=%p,	1
w2_lattice=%p,	1
bias1=%p,	1
bias2=%p\n",	1
(void*)ff->w1_lattice,	1
(void*)ff->w2_lattice,	1
(void*)ff->bias1,	1
(void*)ff->bias2);	1
input_dim	16
ff->input_dim;	3
hidden_dim	16
ff->hidden_dim;	12
output_dim	12
ff->output_dim;	6
hidden	21
(float*)calloc(hidden_dim,	4
grad_hidden	3
(!hidden	1
!grad_hidden)	1
free(hidden);	4
free(grad_hidden);	5
activations	6
hidden_dim;	12
ff->bias1[h];	2
input_dim;	5
ff->w1_lattice[i	4
h];	2
hidden[h]	3
prime_tanhf(sum);	2
relu	5
tanh	5
activation	13
second	19
o	10
output_dim;	7
o++)	3
w2	4
(grad_w2)	1
grad_w2[h	1
o]	4
grad_out[o];	3
grad_hidden[h]	4
ff->w2_lattice[h	3
bias2	2
(grad_b2)	1
grad_b2[o]	1
tanh_val	7
hidden[h];	2
*=	104
(1.0f	35
tanh_val);	3
derivative	1
memset(grad_in,	1
w1	3
(grad_w1)	1
grad_w1[i	1
h]	4
grad_hidden[h];	6
bias1	2
(grad_b1)	1
grad_b1[h]	1
(simplified)	5
backward_attention(float*	1
attn,	1
grad_query,	1
grad_key,	1
grad_value)	1
!attn)	1
(!attn->query_lattice	2
!attn->key_lattice	2
!attn->value_lattice)	2
attentionlayer	1
query_lattice=%p,	1
key_lattice=%p,	1
value_lattice=%p\n",	1
(void*)attn->query_lattice,	1
(void*)attn->key_lattice,	1
(void*)attn->value_lattice);	1
attn->num_heads	7
attn->head_dim;	9
simplified:	2
require	2
storing	1
now,	24
approximate	5
small	34
memcpy(grad_in,	1
(grad_query)	1
grad_query[i	1
j]	27
grad_out[j]	3
0.1f;	9
(grad_key)	1
grad_key[i	1
(grad_value)	1
grad_value[i	1
internal	6
cllm_backward_impl(cllmtraining*	1
training,	32
uint32_t*	77
input_tokens,	12
target_tokens,	9
batch_size,	19
!training->model	1
!training->gradients)	1
(!input_tokens	2
!target_tokens	2
batch_size	49
embed_dim	100
num_layers	9
cllm_zero_all_gradients(training);	3
pre-allocated	3
(optimization	1
malloc/free	1
overhead)	1
training->backward_embeddings;	1
grad_output	4
training->backward_grad_output;	1
layer_input	5
training->backward_layer_input;	1
layer_grad	1
training->backward_layer_grad;	1
temp_grad	1
training->backward_temp_grad;	1
activation_size	5
embed_dim;	58
check	203
prevent	14
overflow	14
(activation_size	1
training->backward_buffer_size)	1
(%zu)	1
exceeds	4
(%zu)\n",	1
activation_size,	1
training->backward_buffer_size);	1
batch_size=%d,	1
seq_len=%d,	1
embed_dim=%lu\n",	1
seq_len,	16
embed_dim);	5
memset(embeddings,	1
memset(grad_output,	1
memset(layer_input,	1
memset(layer_grad,	1
memset(temp_grad,	1
simplified	13
layers	35
proper	15
we	36
need	15
initialized	9
(!model->ff_layers	1
!model->attention_layers	1
!model->layer_norms)	2
null!\n");	2
ff_layers=%p,	1
attention_layers=%p,	1
layer_norms=%p\n",	1
(void*)model->ff_layers,	1
(void*)model->attention_layers,	1
(void*)model->layer_norms);	1
(!model->embeddings.embeddings)	3
process	42
batch	130
batch_size;	47
b++)	25
s	23
s++)	10
s;	16
input_tokens[idx];	2
target_id	2
target_tokens[idx];	3
model->vocab_size)	9
continue;	61
embedding	110
embed_src	2
&model->embeddings.embeddings[token_id	6
embed_dim];	28
memcpy(layer_input,	1
embed_src,	2
simple	38
loss	74
(mse	1
target	52
embedding)	2
target_embed	3
&model->embeddings.embeddings[target_id	1
layer_grad[d]	1
(layer_input[d]	1
target_embed[d])	1
(batch_size	10
(simplified	7
proxy	1
activations)	3
layer--)	2
backward_feed_forward(layer_grad,	1
temp_grad,	6
layer_input,	5
&model->ff_layers[layer],	1
training->ff_grads[layer].w1_lattice,	1
training->ff_grads[layer].w2_lattice,	1
training->ff_grads[layer].bias1,	1
training->ff_grads[layer].bias2);	1
memcpy(layer_grad,	3
backward_attention(layer_grad,	1
&model->attention_layers[layer],	1
training->attention_grads[layer].query_lattice,	1
training->attention_grads[layer].key_lattice,	1
training->attention_grads[layer].value_lattice);	1
backward_layer_norm(layer_grad,	1
&model->layer_norms[layer],	2
training->ln_grads[layer].gamma,	1
training->ln_grads[layer].beta,	1
grad_embed	2
&training->gradients[token_id	1
grad_embed[d]	2
layer_grad[d];	1
(optimization)	11
public	3
interface	2
wrapper	2
that	31
extracts	2
config	16
cllm_backward(cllmtraining*	1
num_tokens)	9
!input_tokens	5
!target_tokens)	6
training->config.batch_size;	7
training->config.sequence_length;	9
(num_tokens	2
cllm_backward_impl(training,	1
"cllm.h"	3
"cllm_inference.h"	2
<time.h>	16
<sys/time.h>	3
<sys/resource.h>	1
timing	1
typedef	36
struct	67
timeval	4
start;	1
end;	3
elapsed_ms;	1
timer;	5
timer_start(timer*	1
timer)	2
gettimeofday(&timer->start,	1
null);	79
timer_stop(timer*	1
gettimeofday(&timer->end,	1
timer->elapsed_ms	1
(timer->end.tv_sec	1
timer->start.tv_sec)	1
1000.0	2
(timer->end.tv_usec	1
timer->start.tv_usec)	1
1000.0;	1
memory	55
usage	9
peak_rss_kb;	1
peak	2
resident	2
current_rss_kb;	1
current	31
heap_size_kb;	1
heap	1
memoryusage;	1
get_memory_usage(memoryusage*	1
usage)	1
rusage	1
r_usage;	1
getrusage(rusage_self,	1
&r_usage);	1
usage->peak_rss_kb	2
r_usage.ru_maxrss;	1
linux,	1
ru_maxrss	1
is	170
kilobytes	1
macos,	1
it's	9
bytes,	1
so	5
#ifdef	9
__apple__	1
1024;	1
#endif	14
usage->current_rss_kb	1
usage->peak_rss_kb;	1
approximation	23
usage->heap_size_kb	1
malloc_info	1
linux	2
benchmark	12
results	12
inference_time_ms;	1
tokens_per_second;	1
memory_mb;	1
throughput_tokens_per_sec;	1
total_tokens;	2
seq_length;	9
benchmarkresults;	1
benchmarkresults	8
cllm_benchmark_inference_single(cllmmodel*	1
model,	23
input_ids,	5
seq_length,	7
num_iterations)	4
{0};	15
timer	4
memoryusage	4
mem_before,	3
mem_after;	3
(!model	18
!input_ids	2
num_iterations	3
"invalid	7
parameters\n");	3
results;	10
printf("benchmarking	4
inference...\n");	2
length:	10
%zu\n",	28
seq_length);	4
iterations:	4
num_iterations);	4
logits	36
(float*)malloc(model->vocab_size	1
(!logits)	3
"failed	36
buffer\n");	7
get_memory_usage(&mem_before);	3
warm-up	1
run	2
real	10
call	7
actual	17
we'll	2
simulate	6
it	13
runs	1
timer_start(&timer);	4
num_iterations;	9
cllm_forward(model,	1
logits);	1
dummy	7
operation	4
optimization	10
(size_t	187
model->vocab_size;	31
logits[j]	1
(float)j	4
timer_stop(&timer);	4
final	9
get_memory_usage(&mem_after);	3
results.inference_time_ms	4
timer.elapsed_ms	4
results.tokens_per_second	1
results.inference_time_ms;	4
results.memory_mb	3
(mem_after.peak_rss_kb	3
mem_before.peak_rss_kb)	3
1024.0;	3
results.total_tokens	2
results.seq_length	4
results.batch_size	4
free(logits);	2
printf("results:\n");	4
average	17
time	18
token:	1
%.3f	8
ms\n",	6
results.inference_time_ms);	4
second:	1
%.2f\n",	7
results.tokens_per_second);	1
delta:	4
%.2f	19
mb\n",	10
results.memory_mb);	3
cllm_benchmark_inference_batch(cllmmodel*	1
size:	23
batch_size);	3
(float*)malloc(batch_size	2
logits[b	1
results.throughput_tokens_per_sec	3
seq_length	9
1000.0)	3
batch:	2
throughput:	3
tokens/sec\n",	3
results.throughput_tokens_per_sec);	3
cllm_benchmark_forward_pass(cllmmodel*	1
pass...\n");	1
input_ids	2
(uint32_t*)malloc(batch_size	3
model->embedding_dim	11
(!input_ids	3
buffers\n");	4
(input_ids)	2
free(input_ids);	4
random	11
ids	19
input_ids[i]	2
rand()	4
cllm_forward_complete(model,	1
output);	2
computation	20
model->embedding_dim);	2
time:	14
step	49
cllm_benchmark_training_step(cllmmodel*	1
step...\n");	2
target_ids	1
(float*)malloc(model->num_weights	1
!target_ids	1
!gradients)	6
(target_ids)	1
free(target_ids);	2
(gradients)	1
free(gradients);	2
inputs	1
target_ids[i]	1
(forward	1
optimizer)	1
1.	28
2.	28
3.	24
4.	16
optimizer	26
model->num_weights;	5
gradients[j]	1
comprehensive	5
suite	3
cllm_run_benchmark_suite(cllmmodel*	1
model)	23
(!model)	23
"model	11
null\n");	21
printf("\n");	39
printf("╔════════════════════════════════════════════════════════════╗\n");	4
printf("║	4
║\n");	4
printf("╚════════════════════════════════════════════════════════════╝\n");	4
printf("model	2
configuration:\n");	4
vocabulary	50
%lu\n",	59
(unsigned	51
long)model->vocab_size);	5
dimension:	9
long)model->embedding_dim);	3
layers:	6
model->num_layers);	5
total	56
parameters:	3
long)model->num_weights);	2
test	4
test_seq_len	1
128;	1
test_input	1
(uint32_t*)malloc(test_seq_len	1
(!test_input)	1
input\n");	1
test_seq_len;	1
test_input[i]	1
printf("═══════════════════════════════════════════════════════════\n");	8
printf("1.	2
benchmark\n");	4
cllm_benchmark_inference_single(model,	1
test_input,	2
test_seq_len,	4
100);	1
printf("2.	2
cllm_benchmark_inference_batch(model,	1
8,	5
50);	2
printf("3.	2
cllm_benchmark_forward_pass(model,	1
4,	15
printf("4.	2
cllm_benchmark_training_step(model,	1
20);	1
free(test_input);	1
complete	36
profile	2
over	6
cllm_profile_memory(cllmmodel*	1
duration_seconds)	2
printf("profiling	1
seconds...\n",	2
duration_seconds);	1
time_t	11
start_time	4
time(null);	12
current_time;	1
usage;	1
max_rss	3
min_rss	3
size_max;	1
((current_time	1
time(null))	1
get_memory_usage(&usage);	1
(usage.current_rss_kb	2
max_rss)	1
usage.current_rss_kb;	2
min_rss)	2
[%ld	1
s]	1
rss:	3
current_time	1
start_time,	1
usage.current_rss_kb	1
1024.0);	5
sleep	2
timespec	11
ts	2
{1,	1
0};	1
nanosleep(&ts,	2
printf("\nmemory	2
summary:\n");	1
min	4
(max_rss	1
generate	22
performance	8
report	2
cllm_generate_performance_report(cllmmodel*	1
output_file)	1
file*	34
fp	3
fopen(output_file,	2
"w");	8
(!fp)	3
open	11
file:	11
%s\n",	55
output_file);	2
fprintf(fp,	21
"#	3
report\n\n");	1
"##	3
configuration\n\n");	1
"-	7
%lu	10
(%.2f	6
m)\n",	2
long)model->num_weights,	1
model->num_weights	4
1000000.0);	3
"\n");	3
footprint\n\n");	1
model_size	2
sizeof(float);	9
weights:	5
(1024.0	6
1024.0));	6
tokens:	7
kb\n",	1
(model->vocab_size	1
sizeof(cllmtoken))	2
estimated:	1
(model_size	1
results\n\n");	1
"*(results	1
populated	1
running	3
benchmarks)*\n\n");	1
"---\n");	1
"report	1
generated:	2
%s",	9
ctime(&(time_t){time(null)}));	1
fclose(fp);	4
printf("performance	1
written	1
to:	3
provides	11
cache-aligned	3
allocation	15
improved	3
<stddef.h>	3
_win32	5
<malloc.h>	1
void*	37
cache_aligned_alloc(size_t	1
(size	9
windows:	1
_aligned_malloc	1
_aligned_malloc(size,	1
cache_line_size);	1
#else	7
posix:	1
posix_memalign	1
ptr	1
(posix_memalign(&ptr,	1
