<PAD>	0
<UNK>	0
<BOS>	0
<EOS>	0
<MASK>	0
/*	959
*	25340
cllm	371
lattice	917
conversion	91
utilities	98
*/	4536
#include	3745
"../../include/cllm.h"	7
"../../include/bigfixed_core.h"	14
"../../include/bigint_core.h"	21
"../../include/prime_types.h"	7
<stdlib.h>	525
<string.h>	539
<stdio.h>	469
"../include/prime_float_math.h"	231
void	3577
cllm_float_to_bigfixed(bigfixed*	7
output,	161
float*	2191
input,	175
int	6566
n,	364
precision)	105
{	30828
(void)precision;	28
unused	77
parameter	84
-	5509
kept	14
for	10437
api	70
compatibility	49
if	23023
(!output	21
||	6678
!input	84
n	959
<=	1771
0)	3766
return;	3542
(int	3395
i	9723
=	44632
0;	11193
<	9226
n;	490
i++)	4305
big_fixed_from_double(&output[i],	7
(double)input[i]);	7
}	30702
cllm_bigfixed_to_float(float*	7
bigfixed*	105
n)	518
output[i]	49
(float)big_fixed_to_double(&input[i]);	7
cllm_embeddings_to_basis(bigfixed**	7
basis,	133
embeddings,	35
dim,	126
(!basis	28
!embeddings	7
0	1897
dim	567
cllm_float_to_bigfixed(basis[i],	7
&embeddings[i	7
dim],	21
precision);	91
cllm_basis_to_embeddings(float*	7
bigfixed**	105
dim)	168
(!embeddings	21
!basis	42
cllm_bigfixed_to_float(&embeddings[i	7
basis[i],	7
dim);	161
cllm_alloc_bigfixed_basis(int	7
(n	602
return	14273
null;	3094
basis	420
(bigfixed**)malloc(n	35
sizeof(bigfixed*));	42
(!basis)	14
basis[i]	14
(bigfixed*)malloc(dim	28
sizeof(bigfixed));	70
(!basis[i])	7
j	1568
i;	469
j++)	693
free(basis[j]);	7
free(basis);	14
d	882
dim;	406
d++)	350
big_fixed_from_int(&basis[i][d],	7
0);	1148
basis;	21
cllm_free_bigfixed_basis(bigfixed**	7
(basis[i])	7
free(basis[i]);	7
cllm_embedding_to_bigfixed(bigfixed*	7
embedding,	119
cllm_float_to_bigfixed(output,	7
cllm_bigfixed_to_embedding(float*	7
vector,	21
cllm_bigfixed_to_float(embedding,	7
float	4648
cllm_test_conversion_accuracy(float*	7
(!input	21
-1.0f;	49
bigfixed	1491
(bigfixed*)malloc(n	35
output	595
(float*)malloc(n	7
sizeof(float));	1575
(!bigfixed	7
!output)	56
(bigfixed)	7
free(bigfixed);	14
(output)	35
free(output);	91
cllm_float_to_bigfixed(bigfixed,	7
cllm_bigfixed_to_float(output,	7
bigfixed,	7
n);	168
max_error	28
0.0f;	1554
error	56
prime_fabsf(output[i]	7
input[i]);	7
(error	42
>	2877
max_error)	7
error;	7
max_error;	14
cllm_print_conversion_stats(float*	7
cllm_test_conversion_accuracy(input,	7
printf("conversion	7
statistics:\n");	77
printf("	1617
elements:	7
%d\n",	553
precision:	49
%d	357
bits\n",	7
max	168
error:	21
%.10e\n",	7
max_error);	7
(max_error	21
1e-6f)	21
status:	28
excellent	7
1e-6)\n");	7
else	1323
1e-4f)	7
good	28
1e-4)\n");	7
1e-2f)	7
acceptable	7
1e-2)\n");	14
warning	70
>=	1267
pure	70
crystalline	406
embeddings	399
implementation	315
implements	119
crystallineembeddings	21
with	1071
lll-reduced	14
exact	35
token	826
positions,	7
and	1197
morphology	35
graph.	7
implementation:	35
uses	287
only	91
arbitrary	105
precision	343
mathematics.	14
no	322
external	49
math	63
libraries	14
(math.h,	14
gmp,	14
etc.)	35
"cllm_pure_crystalline.h"	21
helper	147
function	224
to	3661
allocate	966
matrix	350
static	1519
allocate_bigfixed_matrix(uint32_t	7
rows,	28
uint32_t	2163
cols,	7
(bigfixed**)malloc(rows	7
(!matrix)	14
(uint32_t	1876
rows;	70
matrix[i]	7
(bigfixed*)malloc(cols	7
(!matrix[i])	7
//	25991
cleanup	287
on	455
failure	56
free(matrix[j]);	7
free(matrix);	21
initialize	1260
each	301
cols;	77
bigint	1582
structures	63
matrix[i][j].integer_part	7
(bigint*)malloc(sizeof(bigint));	385
matrix[i][j].fractional_part	7
(!matrix[i][j].integer_part	7
!matrix[i][j].fractional_part)	7
k	420
k++)	91
l	70
l++)	28
big_free(matrix[k][l].integer_part);	7
free(matrix[k][l].integer_part);	7
big_free(matrix[k][l].fractional_part);	7
free(matrix[k][l].fractional_part);	7
free(matrix[k]);	7
(j	28
j;	126
big_free(matrix[i][l].integer_part);	7
free(matrix[i][l].integer_part);	7
big_free(matrix[i][l].fractional_part);	7
free(matrix[i][l].fractional_part);	7
free(matrix[i]);	14
big_init(matrix[i][j].integer_part);	7
big_init(matrix[i][j].fractional_part);	7
matrix[i][j].scale_bits	7
precision;	56
matrix[i][j].negative	7
matrix;	7
free	777
free_bigfixed_matrix(bigfixed**	7
matrix,	21
cols)	21
(matrix[i])	7
(matrix[i][j].integer_part)	7
big_free(matrix[i][j].integer_part);	7
free(matrix[i][j].integer_part);	7
(matrix[i][j].fractional_part)	7
big_free(matrix[i][j].fractional_part);	7
free(matrix[i][j].fractional_part);	7
create	812
new	168
structure	343
crystallineembeddings*	14
crystalline_embeddings_create(uint32_t	7
vocab_size,	91
lattice_dim)	7
(vocab_size	14
==	4501
lattice_dim	14
fprintf(stderr,	2037
"error:	1141
vocab_size	378
must	210
be	413
0\n");	140
(crystallineembeddings*)malloc(sizeof(crystallineembeddings));	7
(!embeddings)	28
failed	490
crystallineembeddings\n");	7
embeddings->vocab_size	7
vocab_size;	315
embeddings->lattice_dim	21
lattice_dim;	7
embeddings->basis_optimized	7
false;	2121
embeddings->optimization_epoch	7
embeddings->total_lookups	7
embeddings->cache_hits	7
embeddings->avg_lookup_time	7
0.0;	777
(identity	7
initially)	7
embeddings->lattice_basis	7
allocate_bigfixed_matrix(lattice_dim,	14
lattice_dim,	112
256);	49
(!embeddings->lattice_basis)	7
free(embeddings);	63
inverse	210
embeddings->inverse_basis	7
(!embeddings->inverse_basis)	7
free_bigfixed_matrix(embeddings->lattice_basis,	56
lattice_dim);	119
array	399
embeddings->tokens	7
(crystallinetoken**)calloc(vocab_size,	7
sizeof(crystallinetoken*));	7
(!embeddings->tokens)	7
free_bigfixed_matrix(embeddings->inverse_basis,	49
positions	56
embeddings->token_positions	7
allocate_bigfixed_matrix(vocab_size,	7
(!embeddings->token_positions)	7
free(embeddings->tokens);	42
primes	210
embeddings->token_primes	7
(uint64_t*)calloc(vocab_size,	7
sizeof(uint64_t));	35
(!embeddings->token_primes)	7
free_bigfixed_matrix(embeddings->token_positions,	35
graph	14
embeddings->morphology_graph	7
(uint32_t**)malloc(vocab_size	7
sizeof(uint32_t*));	7
(!embeddings->morphology_graph)	7
free(embeddings->token_primes);	28
embeddings->morphology_graph[i]	7
(uint32_t*)calloc(max_derived_tokens,	7
sizeof(uint32_t));	280
(!embeddings->morphology_graph[i])	7
free(embeddings->morphology_graph[j]);	7
free(embeddings->morphology_graph);	21
counts	21
embeddings->morphology_counts	7
(uint8_t*)calloc(vocab_size,	7
sizeof(uint8_t));	7
(!embeddings->morphology_counts)	7
free(embeddings->morphology_graph[i]);	14
embeddings;	7
crystalline_embeddings_free(crystallineembeddings*	7
embeddings)	14
(embeddings->morphology_counts)	7
free(embeddings->morphology_counts);	7
(embeddings->morphology_graph)	7
embeddings->vocab_size;	7
(embeddings->morphology_graph[i])	7
(embeddings->token_primes)	7
(embeddings->token_positions)	7
embeddings->vocab_size,	7
embeddings->lattice_dim);	21
tokens	595
(but	7
don't	84
the	1015
objects	7
themselves	7
they're	28
owned	21
by	420
caller)	7
(embeddings->tokens)	7
(embeddings->inverse_basis)	7
embeddings->lattice_dim,	14
(embeddings->lattice_basis)	7
add	427
bool	1148
crystalline_embeddings_add_token(crystallineembeddings*	7
crystallinetoken*	28
token)	42
!token)	21
null	224
or	315
token\n");	7
(token->token_id	7
embeddings->vocab_size)	21
token_id	203
%u	210
%u\n",	413
token->token_id,	7
embeddings->vocab_size);	21
store	126
pointer	56
embeddings->tokens[token->token_id]	7
token;	42
prime	1323
embeddings->token_primes[token->token_id]	7
token->prime;	7
copy	371
position	448
(from	14
ulam	147
spiral	245
coordinates)	7
&&	2044
3;	301
big_fixed_assign(&embeddings->token_positions[token->token_id][i],	7
&token->lattice_coords[i]);	7
true;	994
get	665
from	931
crystalline_embeddings_get_token(crystallineembeddings*	7
token_id)	42
embeddings\n");	28
(token_id	140
token_id,	126
embeddings->tokens[token_id];	7
identity	77
crystalline_initialize_basis(crystallineembeddings*	7
set	350
embeddings->lattice_dim;	28
(i	392
j)	56
1.0	168
big_from_int(embeddings->lattice_basis[i][j].integer_part,	14
1);	1498
big_from_int(embeddings->lattice_basis[i][j].fractional_part,	14
0.0	98
embeddings->lattice_basis[i][j].negative	7
(same	21
as	231
identity)	7
big_from_int(embeddings->inverse_basis[i][j].integer_part,	14
big_from_int(embeddings->inverse_basis[i][j].fractional_part,	14
embeddings->inverse_basis[i][j].negative	7
compute	1197
(currently	7
just	140
copies	14
token's	28
lattice_coords)	7
crystalline_compute_token_position(crystallineembeddings*	7
position[3])	7
!position)	7
position\n");	28
stored	49
big_fixed_assign(&position[i],	7
&embeddings->token_positions[token_id][i]);	7
operations	245
"../../include/cllm_pure_crystalline.h"	7
"../../include/prime_math_custom.h"	7
"../../include/prime_bigint_transcendental.h"	7
"../../include/bigfixed_constants.h"	7
#define	350
prime_cache_size	14
10000	21
uint64_t	2436
prime_cache[prime_cache_size];	14
prime_cache_initialized	28
integer	273
square	63
root	224
using	665
newton's	35
method	21
floating	7
point	70
isqrt(uint64_t	14
3)	70
1;	1897
initial	56
guess	42
x	1176
y	224
(x	644
+	6062
1)	1043
/	3507
2;	630
method:	21
x_new	14
n/x)	21
2	665
while	1015
(y	119
x)	497
y;	140
x;	217
init_prime_cache(void)	14
(prime_cache_initialized)	14
prime_cache[0]	14
prime_cache[1]	14
count	749
candidate	147
5;	91
(count	119
prime_cache_size)	35
is_prime	112
sqrt_cand	14
isqrt(candidate);	7
prime_cache[i]	35
sqrt_cand;	14
(candidate	21
%	1022
break;	1267
(is_prime)	42
prime_cache[count++]	14
candidate;	84
+=	2709
crystalline_is_prime(uint64_t	7
2)	434
sqrt_n	21
isqrt(n);	14
(uint64_t	294
sqrt_n;	21
crystalline_get_nth_prime(uint32_t	7
init_prime_cache();	42
prime_cache[n];	14
prime_cache_size;	42
prime_cache[prime_cache_size	21
1]	168
(crystalline_is_prime(candidate))	7
count++;	168
crystalline_factorize(uint64_t	7
number,	14
uint64_t*	147
factors,	21
uint8_t*	7
num_factors)	14
(!factors	7
!num_factors)	7
*num_factors	49
(number	35
(crystalline_is_prime(number))	7
factors[0]	7
number;	21
max_prime_factors)	14
factors[(*num_factors)++]	21
number	686
/=	280
max_prime_factors;	7
1	651
crystalline_compute_ulam_position(uint64_t	7
prime,	238
coords[3],	14
(!coords)	21
needed	175
(!coords[i].integer_part)	7
coords[i].integer_part	7
big_init(coords[i].integer_part);	7
(!coords[i].fractional_part)	7
coords[i].fractional_part	7
big_init(coords[i].fractional_part);	7
coords[i].scale_bits	7
coords[i].negative	7
find	448
index	203
prime_index	84
(prime_cache[i]	21
prime)	245
not	378
in	1596
cache,	28
estimate	119
(prime_index	14
1])	7
approximate:	7
≈	196
ln(prime)	7
simplicity,	14
use	875
10	84
rough	35
(uint32_t)(prime	21
10);	35
bigint*	217
idx	182
big_init(idx);	7
big_from_int(idx,	7
prime_index);	14
radius	210
sqrt(prime_index)	7
radius;	14
radius.integer_part	7
radius.fractional_part	7
big_init(radius.integer_part);	7
big_init(radius.fractional_part);	7
radius.scale_bits	7
radius.negative	7
big_sqrt(&radius,	7
idx,	7
angle	385
golden_angle	91
2π	49
φ²	14
2.39996322972865332	7
radians	70
golden_angle;	21
golden_angle.integer_part	7
golden_angle.fractional_part	7
big_init(golden_angle.integer_part);	7
big_init(golden_angle.fractional_part);	7
golden_angle.scale_bits	7
golden_angle.negative	7
big_fixed_from_double(&golden_angle,	7
2.39996322972865332);	7
angle;	49
angle.integer_part	7
angle.fractional_part	7
big_init(angle.integer_part);	7
big_init(angle.fractional_part);	7
angle.scale_bits	7
angle.negative	7
idx_fixed;	7
idx_fixed.integer_part	7
idx_fixed.fractional_part	7
big_init(idx_fixed.integer_part);	7
big_init(idx_fixed.fractional_part);	7
idx_fixed.scale_bits	7
idx_fixed.negative	7
big_fixed_from_int(&idx_fixed,	7
big_fixed_mul(&angle,	7
&golden_angle,	7
&idx_fixed);	7
cos(angle)	7
cos_angle;	7
cos_angle.integer_part	7
cos_angle.fractional_part	7
big_init(cos_angle.integer_part);	7
big_init(cos_angle.fractional_part);	7
cos_angle.scale_bits	7
cos_angle.negative	7
big_cos(&cos_angle,	7
&angle,	21
big_fixed_mul(&coords[0],	7
&radius,	14
&cos_angle);	7
sin(angle)	7
sin_angle;	7
sin_angle.integer_part	7
sin_angle.fractional_part	7
big_init(sin_angle.integer_part);	7
big_init(sin_angle.fractional_part);	7
sin_angle.scale_bits	7
sin_angle.negative	7
big_sin(&sin_angle,	7
big_fixed_mul(&coords[1],	7
&sin_angle);	7
z	70
ln(prime	7
prime_plus_1	7
big_init(prime_plus_1);	7
big_from_int(prime_plus_1,	7
big_ln(&coords[2],	7
prime_plus_1,	7
temporary	84
bigfixed/bigint	7
big_free(prime_plus_1);	7
free(prime_plus_1);	7
big_free(sin_angle.integer_part);	7
free(sin_angle.integer_part);	7
big_free(sin_angle.fractional_part);	7
free(sin_angle.fractional_part);	7
big_free(cos_angle.integer_part);	7
free(cos_angle.integer_part);	7
big_free(cos_angle.fractional_part);	7
free(cos_angle.fractional_part);	7
big_free(idx_fixed.integer_part);	7
free(idx_fixed.integer_part);	7
big_free(idx_fixed.fractional_part);	7
free(idx_fixed.fractional_part);	7
big_free(angle.integer_part);	7
free(angle.integer_part);	7
big_free(angle.fractional_part);	7
free(angle.fractional_part);	7
big_free(golden_angle.integer_part);	7
free(golden_angle.integer_part);	7
big_free(golden_angle.fractional_part);	7
free(golden_angle.fractional_part);	7
big_free(radius.integer_part);	7
free(radius.integer_part);	7
big_free(radius.fractional_part);	7
free(radius.fractional_part);	7
big_free(idx);	7
free(idx);	7
crystalline_token_create(uint32_t	7
const	2569
char*	1309
token_str,	28
(crystallinetoken*)calloc(1,	7
sizeof(crystallinetoken));	7
(!token)	14
token->token_id	14
token_id;	49
(token_str)	7
strncpy(token->token_str,	14
63);	14
token->token_str[63]	7
'\0';	294
token->prime	7
prime;	70
token->is_root	7
crystalline_is_prime(prime);	7
crystalline_factorize(prime,	7
token->prime_factors,	7
&token->num_factors);	7
coordinates	210
token->lattice_coords[i].integer_part	7
token->lattice_coords[i].fractional_part	7
#pragma	21
gcc	21
diagnostic	21
push	7
ignored	7
"-wstringop-overflow"	7
crystalline_compute_ulam_position(prime,	7
token->lattice_coords,	14
pop	7
(token->is_root)	7
token->root_token_id	14
token->num_neighbors	7
token->usage_count	7
token->root_score	7
1.0;	168
crystalline_token_free(crystallinetoken*	7
(token->lattice_coords[i].integer_part)	7
big_free(token->lattice_coords[i].integer_part);	7
free(token->lattice_coords[i].integer_part);	7
(token->lattice_coords[i].fractional_part)	7
big_free(token->lattice_coords[i].fractional_part);	7
free(token->lattice_coords[i].fractional_part);	7
free(token);	7
crystalline_lattice_distance(const	7
pos1[3],	7
pos2[3],	7
distance)	14
(!pos1	21
!pos2	7
!distance)	7
distance	336
(!distance->integer_part)	7
distance->integer_part	7
big_init(distance->integer_part);	7
(!distance->fractional_part)	7
distance->fractional_part	7
big_init(distance->fractional_part);	7
diff[3];	7
diff_sq[3];	7
sum;	175
diff[i].integer_part	7
diff[i].fractional_part	7
big_init(diff[i].integer_part);	7
big_init(diff[i].fractional_part);	7
diff_sq[i].integer_part	7
diff_sq[i].fractional_part	7
big_init(diff_sq[i].integer_part);	7
big_init(diff_sq[i].fractional_part);	7
sum.integer_part	7
sum.fractional_part	7
big_init(sum.integer_part);	7
big_init(sum.fractional_part);	7
big_fixed_sub(&diff[i],	7
&pos1[i],	7
&pos2[i]);	7
big_fixed_mul(&diff_sq[i],	7
&diff[i],	7
&diff[i]);	7
big_fixed_from_int(&sum,	7
temp;	301
temp.integer_part	7
temp.fractional_part	7
big_init(temp.integer_part);	7
big_init(temp.fractional_part);	7
big_fixed_add(&temp,	7
&sum,	7
&diff_sq[i]);	7
big_free(sum.integer_part);	14
big_free(sum.fractional_part);	14
free(sum.integer_part);	14
free(sum.fractional_part);	14
sum	777
sqrt(sum)	7
first	357
convert	329
big_sqrt	7
sum_int	7
big_init(sum_int);	7
big_fixed_to_bigint_rounded(sum_int,	7
&sum);	7
sqrt	7
big_sqrt(distance,	7
sum_int,	7
big_free(sum_int);	7
free(sum_int);	7
big_free(diff[i].integer_part);	7
big_free(diff[i].fractional_part);	7
free(diff[i].integer_part);	7
free(diff[i].fractional_part);	7
big_free(diff_sq[i].integer_part);	7
big_free(diff_sq[i].fractional_part);	7
free(diff_sq[i].integer_part);	7
free(diff_sq[i].fractional_part);	7
crystalline_prime_similarity(uint64_t	7
prime1,	56
prime2,	21
similarity)	7
(!similarity)	7
(!similarity->integer_part)	7
similarity->integer_part	7
big_init(similarity->integer_part);	7
(!similarity->fractional_part)	7
similarity->fractional_part	7
big_init(similarity->fractional_part);	7
(prime1	56
prime2)	84
big_fixed_from_double(similarity,	21
1.0);	35
a	1092
b	686
prime2;	21
(b	119
!=	1365
temp	203
b;	259
gcd	196
a;	63
(gcd	56
0.5);	21
double	2968
sim	14
(double)gcd;	7
(sim	7
1.0)	63
sim);	7
crystalline_phase_alignment(uint64_t	7
alignment)	7
(!alignment)	7
(!alignment->integer_part)	7
alignment->integer_part	7
big_init(alignment->integer_part);	7
(!alignment->fractional_part)	7
alignment->fractional_part	7
big_init(alignment->fractional_part);	7
phase_diff	21
π	77
big_pi	14
pi;	35
pi.integer_part	7
pi.fractional_part	7
big_init(pi.integer_part);	7
big_init(pi.fractional_part);	7
pi.scale_bits	7
256;	70
pi.negative	7
big_pi(&pi,	7
two_pi;	49
two_pi.integer_part	7
two_pi.fractional_part	7
big_init(two_pi.integer_part);	7
big_init(two_pi.fractional_part);	7
two_pi.scale_bits	7
two_pi.negative	7
two;	63
two.integer_part	7
two.fractional_part	7
big_init(two.integer_part);	7
big_init(two.fractional_part);	7
two.scale_bits	7
two.negative	7
big_fixed_from_int(&two,	7
2);	175
big_fixed_mul(&two_pi,	7
&pi,	7
&two);	21
int64_t	231
diff	238
(int64_t)prime1	7
(int64_t)prime2;	7
diff_fixed;	7
diff_fixed.integer_part	7
diff_fixed.fractional_part	7
big_init(diff_fixed.integer_part);	7
big_init(diff_fixed.fractional_part);	7
diff_fixed.scale_bits	7
diff_fixed.negative	7
(diff	70
?	1078
:	1078
big_fixed_from_int(&diff_fixed,	7
-diff	7
diff);	21
sum_primes	7
prime1	28
sum_fixed;	7
sum_fixed.integer_part	7
sum_fixed.fractional_part	7
big_init(sum_fixed.integer_part);	7
big_init(sum_fixed.fractional_part);	7
sum_fixed.scale_bits	7
sum_fixed.negative	7
big_fixed_from_int(&sum_fixed,	7
sum_primes);	7
numerator;	14
numerator.integer_part	7
numerator.fractional_part	7
big_init(numerator.integer_part);	7
big_init(numerator.fractional_part);	7
numerator.scale_bits	7
numerator.negative	7
big_fixed_mul(&numerator,	7
&two_pi,	7
&diff_fixed);	7
numerator	28
phase_diff;	7
phase_diff.integer_part	7
phase_diff.fractional_part	7
big_init(phase_diff.integer_part);	7
big_init(phase_diff.fractional_part);	7
phase_diff.scale_bits	7
phase_diff.negative	7
big_fixed_div(&phase_diff,	7
&numerator,	14
&sum_fixed);	7
cos(phase_diff)	7
cos_phase;	7
cos_phase.integer_part	7
cos_phase.fractional_part	7
big_init(cos_phase.integer_part);	7
big_init(cos_phase.fractional_part);	7
cos_phase.scale_bits	7
cos_phase.negative	7
big_cos(&cos_phase,	7
&phase_diff,	7
(1	133
cos(phase_diff))	14
one;	98
one.integer_part	7
one.fractional_part	7
big_init(one.integer_part);	7
big_init(one.fractional_part);	7
one.scale_bits	7
one.negative	7
big_fixed_from_int(&one,	7
one_plus_cos;	7
one_plus_cos.integer_part	7
one_plus_cos.fractional_part	7
big_init(one_plus_cos.integer_part);	7
big_init(one_plus_cos.fractional_part);	7
one_plus_cos.scale_bits	7
one_plus_cos.negative	7
big_fixed_add(&one_plus_cos,	7
&one,	133
&cos_phase);	7
alignment	28
big_fixed_div(alignment,	7
&one_plus_cos,	7
big_free(one_plus_cos.integer_part);	7
free(one_plus_cos.integer_part);	7
big_free(one_plus_cos.fractional_part);	7
free(one_plus_cos.fractional_part);	7
big_free(one.integer_part);	7
free(one.integer_part);	7
big_free(one.fractional_part);	7
free(one.fractional_part);	7
big_free(cos_phase.integer_part);	7
free(cos_phase.integer_part);	7
big_free(cos_phase.fractional_part);	7
free(cos_phase.fractional_part);	7
big_free(phase_diff.integer_part);	7
free(phase_diff.integer_part);	7
big_free(phase_diff.fractional_part);	7
free(phase_diff.fractional_part);	7
big_free(numerator.integer_part);	7
free(numerator.integer_part);	7
big_free(numerator.fractional_part);	7
free(numerator.fractional_part);	7
big_free(sum_fixed.integer_part);	7
free(sum_fixed.integer_part);	7
big_free(sum_fixed.fractional_part);	7
free(sum_fixed.fractional_part);	7
big_free(diff_fixed.integer_part);	7
free(diff_fixed.integer_part);	7
big_free(diff_fixed.fractional_part);	7
free(diff_fixed.fractional_part);	7
big_free(two.integer_part);	7
free(two.integer_part);	7
big_free(two.fractional_part);	7
free(two.fractional_part);	7
big_free(two_pi.integer_part);	7
free(two_pi.integer_part);	7
big_free(two_pi.fractional_part);	7
free(two_pi.fractional_part);	7
big_free(pi.integer_part);	7
free(pi.integer_part);	7
big_free(pi.fractional_part);	7
free(pi.fractional_part);	7
attention	770
mechanism	21
multi-head	35
self-attention	7
<immintrin.h>	28
"../include/cllm.h"	133
"../include/cllm_inference.h"	70
"../include/cllm_simd_utils.h"	21
"../include/cllm_cache.h"	21
forward	294
declarations	42
missing	21
functions	476
prime_exp(double	21
x);	252
prime_sqrt(double	21
/**	3577
softmax	154
@param	2296
input/output	112
size	882
softmax(float*	7
x,	420
size)	287
(!x	77
numerical	147
stability	161
max_val	98
x[0];	7
size;	385
(x[i]	42
max_val)	28
x[i];	28
exp	70
x[i]	112
prime_exp(x[i]	7
max_val);	21
normalize	252
(sum	28
1e-8f)	84
scaled	21
dot-product	14
single	105
head	175
attention(q,	7
k,	210
v)	35
softmax(q	7
k^t	7
sqrt(d_k))	7
v	483
query	168
vector	350
[head_dim]	42
keys	42
key	133
[seq_len	105
head_dim]	14
values	175
value	385
head_dim	455
dimension	350
per	210
seq_len	686
sequence	280
length	147
scaled_dot_product_attention(float*	7
query,	21
keys,	21
values,	42
head_dim,	42
seq_len)	91
(!query	14
!keys	35
!values	21
!output	84
scale	420
1.0f	238
prime_sqrt((float)head_dim);	7
scores	63
(float*)malloc(seq_len	56
(!scores)	7
simd	56
dot	210
product:	21
scores[i]	28
·	7
keys[i]	7
sqrt(head_dim)	7
seq_len;	455
prefetch	35
next	224
better	56
cache	490
utilization	35
prefetch_read(&keys[(i	7
head_dim]);	14
dot_product(query,	7
&keys[i	14
head_dim],	7
head_dim)	14
scale;	301
apply	679
weights	469
softmax(scores,	7
seq_len);	84
weighted	14
of	1113
memset(output,	28
0,	847
prefetch_read(&values[(i	7
values[i]	14
score	63
scores[i];	14
j_vec	14
(head_dim	7
8)	182
8;	105
__m256	224
vscore	7
_mm256_set1_ps(score);	7
vectorized	84
accumulation	175
(;	126
j_vec;	14
vval	7
_mm256_loadu_ps(&values[i	7
j]);	56
vout	14
_mm256_loadu_ps(&output[j]);	7
_mm256_fmadd_ps(vscore,	7
vval,	7
vout);	14
_mm256_storeu_ps(&output[j],	7
scalar	119
remainder	119
head_dim;	203
output[j]	14
values[i	7
j];	35
free(scores);	7
pass	399
layer	1057
parameters	294
input	427
embedding_dim]	70
key_cache	14
cached	77
(can	14
null)	189
value_cache	14
cllm_attention_forward(attentionlayer*	7
layer,	84
key_cache,	21
value_cache,	21
(!layer	49
num_heads	112
layer->num_heads;	14
layer->head_dim;	28
embedding_dim	343
buffers	231
q,	154
projections	49
queries	35
(!queries	28
!values)	14
(queries)	7
free(queries);	42
(keys)	7
free(keys);	42
(values)	7
free(values);	42
project	77
directly	14
full	224
implementation,	35
these	42
would	182
separate	14
projection	91
matrices	35
(void)num_heads;	7
used	105
structure,	14
suppress	63
(void)head_dim;	7
pos	308
pos++)	84
input_vec	21
&input[pos	21
embedding_dim];	77
h	539
num_heads;	91
h++)	147
size_t	2443
weight_idx	63
layer->query_lattice[weight_idx]	14
input_vec[h	63
i];	119
queries[pos	21
d]	91
layer->key_lattice[weight_idx]	14
keys[pos	21
layer->value_lattice[weight_idx]	14
values[pos	21
keys/values	7
available	105
(key_cache)	14
memcpy(keys,	7
(value_cache)	14
memcpy(values,	7
&queries[pos	14
head_dim];	70
head_keys	7
&keys[h	7
head_values	7
&values[h	7
head_output	14
&output[pos	14
this	581
scaled_dot_product_attention(query,	7
head_keys,	7
head_values,	7
head_output,	7
update	609
caches	14
provided	42
memcpy(key_cache,	7
memcpy(value_cache,	7
kv	7
(for	112
autoregressive	7
generation)	7
inf	91
inference	175
engine	42
state	567
layer_idx	21
cllm_multi_head_attention(cllminference*	7
inf,	49
layer_idx,	7
(!inf	49
(layer_idx	7
(int)inf->model->num_layers)	7
attentionlayer*	105
&inf->model->attention_layers[layer_idx];	7
calculate	476
offsets	7
inf->model->embedding_dim;	7
cache_offset	7
inf->kv_cache_size	7
embedding_dim;	168
inf->key_cache	7
&inf->key_cache[cache_offset]	7
inf->value_cache	7
&inf->value_cache[cache_offset]	7
cllm_attention_forward(layer,	7
heads	7
cllm_attention_init(attentionlayer*	7
num_heads,	14
layer->num_heads	21
layer->head_dim	7
weight_size	21
layer->query_lattice	14
(float*)calloc(weight_size,	42
layer->key_lattice	14
layer->value_lattice	14
(!layer->query_lattice	7
!layer->key_lattice	7
!layer->value_lattice)	7
cllm_attention_free(layer);	7
cllm_attention_free(attentionlayer*	7
layer)	28
(!layer)	14
(layer->query_lattice)	7
free(layer->query_lattice);	7
(layer->key_lattice)	7
free(layer->key_lattice);	7
(layer->value_lattice)	7
free(layer->value_lattice);	7
backward	308
training	980
computes	21
gradients	903
all	882
model	952
"cllm_training.h"	84
"cllm_utils.h"	14
zero	308
gradient	1001
before	35
cllm_zero_all_gradients(cllmtraining*	7
training)	98
(!training	161
!training->model)	21
cllmmodel*	259
training->model;	84
main	98
buffer	266
(only	7
are	308
here)	7
(training->gradients)	28
embed_size	56
model->vocab_size	91
model->embedding_dim;	252
memset(training->gradients,	7
(training->attention_grads)	35
model->num_layers;	189
&model->attention_layers[i];	49
lattice_size	28
(training->attention_grads[i].query_lattice)	7
memset(training->attention_grads[i].query_lattice,	7
(training->attention_grads[i].key_lattice)	7
memset(training->attention_grads[i].key_lattice,	7
(training->attention_grads[i].value_lattice)	7
memset(training->attention_grads[i].value_lattice,	7
feed-forward	224
(training->ff_grads)	28
feedforwardlayer*	98
&model->ff_layers[i];	49
(training->ff_grads[i].w1_lattice)	7
memset(training->ff_grads[i].w1_lattice,	7
layer->input_dim	21
layer->hidden_dim	28
(training->ff_grads[i].w2_lattice)	7
memset(training->ff_grads[i].w2_lattice,	7
layer->output_dim	21
(training->ff_grads[i].bias1)	7
memset(training->ff_grads[i].bias1,	7
(training->ff_grads[i].bias2)	7
memset(training->ff_grads[i].bias2,	7
norm	420
(training->ln_grads)	14
cllmlayernorm*	49
&model->layer_norms[i];	14
(training->ln_grads[i].gamma)	7
memset(training->ln_grads[i].gamma,	7
layer->dim	14
(training->ln_grads[i].beta)	7
memset(training->ln_grads[i].beta,	7
through	140
normalization	140
backward_layer_norm(float*	7
grad_out,	28
grad_in,	21
ln,	49
grad_gamma,	7
grad_beta,	7
critical:	77
checks	42
(!grad_out	21
!grad_in	21
!x	35
!ln)	14
(!ln->gamma	14
!ln->beta)	14
layernorm	21
has	126
pointers!\n");	21
"	140
gamma=%p,	7
beta=%p\n",	7
(void*)ln->gamma,	7
(void*)ln->beta);	7
mean	189
variance	84
0.0f,	77
var	84
mean;	35
diff;	98
std	49
prime_sqrtf(var	28
1e-5f);	21
inv_std	28
std;	28
grad_var	42
grad_mean	42
x_norm	14
mean)	70
inv_std;	14
w.r.t.	161
gamma	98
beta	63
(grad_gamma)	7
grad_gamma[i]	7
grad_out[i]	21
x_norm;	14
(grad_beta)	7
grad_beta[i]	7
grad_out[i];	7
normalized	42
grad_x_norm	70
ln->gamma[i];	14
accumulate	196
-0.5f	14
-inv_std;	7
grad_in[i]	14
2.0f	252
backward_feed_forward(float*	7
ff,	7
grad_w1,	7
grad_w2,	7
grad_b1,	7
grad_b2)	7
!ff)	14
(!ff->w1_lattice	7
!ff->w2_lattice	7
!ff->bias1	7
!ff->bias2)	7
feedforwardlayer	7
w1_lattice=%p,	7
w2_lattice=%p,	7
bias1=%p,	7
bias2=%p\n",	7
(void*)ff->w1_lattice,	7
(void*)ff->w2_lattice,	7
(void*)ff->bias1,	7
(void*)ff->bias2);	7
input_dim	112
ff->input_dim;	21
hidden_dim	112
ff->hidden_dim;	84
output_dim	84
ff->output_dim;	42
hidden	189
(float*)calloc(hidden_dim,	28
grad_hidden	21
(!hidden	7
!grad_hidden)	7
free(hidden);	28
free(grad_hidden);	35
activations	42
hidden_dim;	84
ff->bias1[h];	14
input_dim;	35
ff->w1_lattice[i	28
h];	14
hidden[h]	21
prime_tanhf(sum);	14
relu	35
tanh	35
activation	91
second	133
o	70
output_dim;	49
o++)	21
w2	28
(grad_w2)	7
grad_w2[h	7
o]	28
grad_out[o];	21
grad_hidden[h]	28
ff->w2_lattice[h	21
bias2	14
(grad_b2)	7
grad_b2[o]	7
tanh_val	49
hidden[h];	14
*=	728
(1.0f	245
tanh_val);	21
derivative	7
memset(grad_in,	7
w1	21
(grad_w1)	7
grad_w1[i	7
h]	28
grad_hidden[h];	42
bias1	14
(grad_b1)	7
grad_b1[h]	7
(simplified)	28
backward_attention(float*	7
attn,	7
grad_query,	7
grad_key,	7
grad_value)	7
!attn)	7
(!attn->query_lattice	14
!attn->key_lattice	14
!attn->value_lattice)	14
attentionlayer	7
query_lattice=%p,	7
key_lattice=%p,	7
value_lattice=%p\n",	7
(void*)attn->query_lattice,	7
(void*)attn->key_lattice,	7
(void*)attn->value_lattice);	7
attn->num_heads	49
attn->head_dim;	63
simplified:	14
require	14
storing	7
now,	168
approximate	35
small	238
memcpy(grad_in,	7
(grad_query)	7
grad_query[i	7
j]	189
grad_out[j]	21
0.1f;	63
(grad_key)	7
grad_key[i	7
(grad_value)	7
grad_value[i	7
internal	42
cllm_backward_impl(cllmtraining*	7
training,	217
uint32_t*	539
input_tokens,	84
target_tokens,	63
batch_size,	133
!training->model	7
!training->gradients)	7
(!input_tokens	14
!target_tokens	14
batch_size	343
embed_dim	700
num_layers	63
cllm_zero_all_gradients(training);	21
pre-allocated	21
(optimization	7
malloc/free	7
overhead)	7
training->backward_embeddings;	7
grad_output	28
training->backward_grad_output;	7
layer_input	35
training->backward_layer_input;	7
layer_grad	7
training->backward_layer_grad;	7
temp_grad	7
training->backward_temp_grad;	7
activation_size	35
embed_dim;	406
check	1414
prevent	98
overflow	98
(activation_size	7
training->backward_buffer_size)	7
(%zu)	7
exceeds	28
(%zu)\n",	7
activation_size,	7
training->backward_buffer_size);	7
batch_size=%d,	7
seq_len=%d,	7
embed_dim=%lu\n",	7
seq_len,	112
embed_dim);	35
memset(embeddings,	7
memset(grad_output,	7
memset(layer_input,	7
memset(layer_grad,	7
memset(temp_grad,	7
simplified	91
layers	245
proper	105
we	252
need	105
initialized	63
(!model->ff_layers	7
!model->attention_layers	7
!model->layer_norms)	14
null!\n");	14
ff_layers=%p,	7
attention_layers=%p,	7
layer_norms=%p\n",	7
(void*)model->ff_layers,	7
(void*)model->attention_layers,	7
(void*)model->layer_norms);	7
(!model->embeddings.embeddings)	21
process	266
batch	833
batch_size;	329
b++)	175
s	161
s++)	70
s;	112
input_tokens[idx];	14
target_id	14
target_tokens[idx];	21
model->vocab_size)	63
continue;	420
embedding	770
embed_src	14
&model->embeddings.embeddings[token_id	42
embed_dim];	196
memcpy(layer_input,	7
embed_src,	14
simple	266
loss	511
(mse	7
target	364
embedding)	14
target_embed	21
&model->embeddings.embeddings[target_id	7
layer_grad[d]	7
(layer_input[d]	7
target_embed[d])	7
(batch_size	70
(simplified	49
proxy	7
activations)	21
layer--)	14
backward_feed_forward(layer_grad,	7
temp_grad,	42
layer_input,	35
&model->ff_layers[layer],	7
training->ff_grads[layer].w1_lattice,	7
training->ff_grads[layer].w2_lattice,	7
training->ff_grads[layer].bias1,	7
training->ff_grads[layer].bias2);	7
memcpy(layer_grad,	21
backward_attention(layer_grad,	7
&model->attention_layers[layer],	7
training->attention_grads[layer].query_lattice,	7
training->attention_grads[layer].key_lattice,	7
training->attention_grads[layer].value_lattice);	7
backward_layer_norm(layer_grad,	7
&model->layer_norms[layer],	14
training->ln_grads[layer].gamma,	7
training->ln_grads[layer].beta,	7
grad_embed	14
&training->gradients[token_id	7
grad_embed[d]	14
layer_grad[d];	7
(optimization)	77
public	21
interface	14
wrapper	14
that	217
extracts	14
config	112
cllm_backward(cllmtraining*	7
num_tokens)	63
!input_tokens	35
!target_tokens)	42
training->config.batch_size;	49
training->config.sequence_length;	63
(num_tokens	14
cllm_backward_impl(training,	7
"cllm.h"	21
"cllm_inference.h"	14
<time.h>	112
<sys/time.h>	21
<sys/resource.h>	7
timing	7
typedef	238
struct	448
timeval	28
start;	7
end;	21
elapsed_ms;	7
timer;	35
timer_start(timer*	7
timer)	14
gettimeofday(&timer->start,	7
null);	511
timer_stop(timer*	7
gettimeofday(&timer->end,	7
timer->elapsed_ms	7
(timer->end.tv_sec	7
timer->start.tv_sec)	7
1000.0	14
(timer->end.tv_usec	7
timer->start.tv_usec)	7
1000.0;	7
memory	385
usage	63
peak_rss_kb;	7
peak	14
resident	14
current_rss_kb;	7
current	217
heap_size_kb;	7
heap	7
memoryusage;	7
get_memory_usage(memoryusage*	7
usage)	7
rusage	7
r_usage;	7
getrusage(rusage_self,	7
&r_usage);	7
usage->peak_rss_kb	14
r_usage.ru_maxrss;	7
linux,	7
ru_maxrss	7
is	1190
kilobytes	7
macos,	7
it's	63
bytes,	7
so	35
#ifdef	63
__apple__	7
1024;	7
#endif	98
usage->current_rss_kb	7
usage->peak_rss_kb;	7
approximation	161
usage->heap_size_kb	7
malloc_info	7
linux	14
benchmark	84
results	84
inference_time_ms;	7
tokens_per_second;	7
memory_mb;	7
throughput_tokens_per_sec;	7
total_tokens;	14
seq_length;	63
benchmarkresults;	7
benchmarkresults	56
cllm_benchmark_inference_single(cllmmodel*	7
model,	161
input_ids,	35
seq_length,	49
num_iterations)	28
{0};	105
timer	28
memoryusage	28
mem_before,	21
mem_after;	21
(!model	126
!input_ids	14
num_iterations	21
"invalid	49
parameters\n");	21
results;	70
printf("benchmarking	28
inference...\n");	14
length:	70
%zu\n",	196
seq_length);	28
iterations:	28
num_iterations);	28
logits	252
(float*)malloc(model->vocab_size	7
(!logits)	21
"failed	252
buffer\n");	49
get_memory_usage(&mem_before);	21
warm-up	7
run	14
real	63
call	42
actual	112
we'll	14
simulate	42
it	91
runs	7
timer_start(&timer);	28
num_iterations;	63
cllm_forward(model,	7
logits);	7
dummy	49
operation	28
optimization	70
(size_t	1288
model->vocab_size;	217
logits[j]	7
(float)j	28
timer_stop(&timer);	28
final	63
get_memory_usage(&mem_after);	21
results.inference_time_ms	28
timer.elapsed_ms	28
results.tokens_per_second	7
results.inference_time_ms;	28
results.memory_mb	21
(mem_after.peak_rss_kb	21
mem_before.peak_rss_kb)	21
1024.0;	21
results.total_tokens	14
results.seq_length	28
results.batch_size	28
free(logits);	14
printf("results:\n");	28
average	105
time	126
token:	7
%.3f	56
ms\n",	42
results.inference_time_ms);	28
second:	7
%.2f\n",	49
results.tokens_per_second);	7
delta:	28
%.2f	133
mb\n",	70
results.memory_mb);	21
cllm_benchmark_inference_batch(cllmmodel*	7
size:	161
batch_size);	21
(float*)malloc(batch_size	14
logits[b	7
results.throughput_tokens_per_sec	21
seq_length	63
1000.0)	21
batch:	14
throughput:	21
tokens/sec\n",	21
results.throughput_tokens_per_sec);	21
cllm_benchmark_forward_pass(cllmmodel*	7
pass...\n");	7
input_ids	14
(uint32_t*)malloc(batch_size	21
model->embedding_dim	77
(!input_ids	21
buffers\n");	28
(input_ids)	14
free(input_ids);	28
random	77
ids	133
input_ids[i]	14
rand()	28
cllm_forward_complete(model,	7
output);	14
computation	133
model->embedding_dim);	14
time:	98
step	343
cllm_benchmark_training_step(cllmmodel*	7
step...\n");	14
target_ids	7
(float*)malloc(model->num_weights	7
!target_ids	7
!gradients)	42
(target_ids)	7
free(target_ids);	14
(gradients)	7
free(gradients);	14
inputs	7
target_ids[i]	7
(forward	7
optimizer)	7
1.	196
2.	196
3.	168
4.	112
optimizer	175
model->num_weights;	35
gradients[j]	7
comprehensive	35
suite	21
cllm_run_benchmark_suite(cllmmodel*	7
model)	161
(!model)	161
"model	77
null\n");	147
printf("\n");	266
printf("╔════════════════════════════════════════════════════════════╗\n");	28
printf("║	28
║\n");	28
printf("╚════════════════════════════════════════════════════════════╝\n");	28
printf("model	14
configuration:\n");	28
vocabulary	350
%lu\n",	413
(unsigned	357
long)model->vocab_size);	35
dimension:	63
long)model->embedding_dim);	21
layers:	42
model->num_layers);	35
total	378
parameters:	21
long)model->num_weights);	14
test	28
test_seq_len	7
128;	7
test_input	7
(uint32_t*)malloc(test_seq_len	7
(!test_input)	7
input\n");	7
test_seq_len;	7
test_input[i]	7
printf("═══════════════════════════════════════════════════════════\n");	56
printf("1.	14
benchmark\n");	28
cllm_benchmark_inference_single(model,	7
test_input,	14
test_seq_len,	28
100);	7
printf("2.	14
cllm_benchmark_inference_batch(model,	7
8,	35
50);	14
printf("3.	14
cllm_benchmark_forward_pass(model,	7
4,	105
printf("4.	14
cllm_benchmark_training_step(model,	7
20);	7
free(test_input);	7
complete	231
profile	14
over	42
cllm_profile_memory(cllmmodel*	7
duration_seconds)	14
printf("profiling	7
seconds...\n",	14
duration_seconds);	7
time_t	77
start_time	28
time(null);	84
current_time;	7
usage;	7
max_rss	21
min_rss	21
size_max;	7
((current_time	7
time(null))	7
get_memory_usage(&usage);	7
(usage.current_rss_kb	14
max_rss)	7
usage.current_rss_kb;	14
min_rss)	14
[%ld	7
s]	7
rss:	21
current_time	7
start_time,	7
usage.current_rss_kb	7
1024.0);	35
sleep	14
timespec	77
ts	14
{1,	7
0};	7
nanosleep(&ts,	14
printf("\nmemory	14
summary:\n");	7
min	28
(max_rss	7
generate	154
performance	56
report	14
cllm_generate_performance_report(cllmmodel*	7
output_file)	7
file*	238
fp	21
fopen(output_file,	14
"w");	56
(!fp)	21
open	77
file:	77
%s\n",	385
output_file);	14
fprintf(fp,	147
"#	21
report\n\n");	7
"##	21
configuration\n\n");	7
"-	49
%lu	70
(%.2f	42
m)\n",	14
long)model->num_weights,	7
model->num_weights	28
1000000.0);	21
"\n");	21
footprint\n\n");	7
model_size	14
sizeof(float);	63
weights:	35
(1024.0	42
1024.0));	42
tokens:	49
kb\n",	7
(model->vocab_size	7
sizeof(cllmtoken))	14
estimated:	7
(model_size	7
results\n\n");	7
"*(results	7
populated	7
running	21
benchmarks)*\n\n");	7
"---\n");	7
"report	7
generated:	14
%s",	63
ctime(&(time_t){time(null)}));	7
fclose(fp);	28
printf("performance	7
written	7
to:	21
provides	77
cache-aligned	21
allocation	105
improved	21
<stddef.h>	21
_win32	35
<malloc.h>	7
void*	245
cache_aligned_alloc(size_t	7
(size	63
windows:	7
_aligned_malloc	7
_aligned_malloc(size,	7
cache_line_size);	7
#else	49
posix:	7
posix_memalign	7
ptr	7
(posix_memalign(&ptr,	7
cache_line_size,	7
ptr;	7
cache_aligned_free(void*	7
ptr)	14
(!ptr)	7
_aligned_free(ptr);	7
free(ptr);	14
"../include/cllm_training.h"	70
configuration	224
cllm_create_model(const	7
cllmconfig*	49
config)	98
(!config)	70
validate	252
(config->vocab_size	14
config->embedding_dim	112
config->num_layers	56
config->num_heads	28
configuration\n");	28
divisible	35
(config->embedding_dim	28
"embedding_dim	7
num_heads\n");	14
(cllmmodel*)calloc(1,	7
sizeof(cllmmodel));	7
model\n");	14
basic	133
config->vocab_size;	28
config->embedding_dim;	133
model->num_layers	77
config->num_layers;	28
header	119
memcpy(model->header.magic,	7
"cllm",	21
4);	35
model->header.version	7
model->header.vocab_size	7
model->header.embedding_dim	7
model->header.num_layers	7
model->header.num_heads	7
config->num_heads;	21
model->header.context_length	7
config->max_seq_len;	14
model->tokens	28
(cllmtoken*)calloc(config->vocab_size,	7
sizeof(cllmtoken));	21
(!model->tokens)	14
tokens\n");	7
free(model);	70
default	217
model->tokens[i].frequency	21
snprintf(model->tokens[i].token_str,	14
sizeof(model->tokens[i].token_str),	14
"token_%u",	7
i);	280
model->tokens[i].symmetry_group	7
embedding_weights	28
config->vocab_size	28
per-layer	7
attention:	7
3	231
(q,	7
projections)	7
feed-forward:	7
ff_dim	14
(weights	21
biases)	7
norm:	56
4	49
(2	63
norms	63
beta)	7
per_layer_weights	14
config->ff_dim	49
per_layer_weights;	14
model->header.total_params	7
model->weights	70
(float*)calloc(model->num_weights,	7
(!model->weights)	7
weights\n");	7
free(model->tokens);	70
model->embeddings.vocab_size	28
model->embeddings.embedding_dim	7
model->embeddings.embeddings	7
model->weights;	7
embedding_weights;	14
model->embeddings.embeddings[i]	14
((float)rand()	70
rand_max	42
0.5f)	70
model->attention_layers	7
(attentionlayer*)calloc(config->num_layers,	7
sizeof(attentionlayer));	7
(!model->attention_layers)	14
layers\n");	14
free(model->weights);	49
weight_offset	70
model->attention_layers[i].layer_id	7
model->attention_layers[i].num_heads	14
model->attention_layers[i].head_dim	7
assign	42
weight	343
pointers	42
bounds	21
checking	35
qkv_size	14
verify	49
exceed	21
allocated	98
(weight_offset	14
model->num_weights)	21
offset	105
at	273
free(model->attention_layers);	49
model->attention_layers[i].query_lattice	7
weight_offset;	63
qkv_size;	28
model->attention_layers[i].key_lattice	7
model->attention_layers[i].value_lattice	7
xavier	14
initialization	224
xavier_std	7
prime_sqrtf(2.0f	21
config->embedding_dim));	7
model->attention_layers[i].query_lattice[j]	7
xavier_std;	21
model->attention_layers[i].key_lattice[j]	7
model->attention_layers[i].value_lattice[j]	7
model->ff_layers	14
(feedforwardlayer*)calloc(config->num_layers,	7
sizeof(feedforwardlayer));	7
(!model->ff_layers)	14
model->ff_layers[i].layer_id	7
model->ff_layers[i].input_dim	14
model->ff_layers[i].hidden_dim	14
config->ff_dim;	28
model->ff_layers[i].output_dim	7
w1_size	42
w2_size	42
total_ff_size	14
ff	91
free(model->ff_layers);	35
model->ff_layers[i].w1_lattice	7
w1_size;	28
model->ff_layers[i].bias1	7
model->ff_layers[i].w2_lattice	7
w2_size;	28
model->ff_layers[i].bias2	7
he	35
relu/tanh)	7
he_std_w1	7
config->embedding_dim);	14
he_std_w2	7
config->ff_dim);	14
model->ff_layers[i].w1_lattice[j]	7
he_std_w1;	7
model->ff_layers[i].bias1[j]	7
biases	42
model->ff_layers[i].w2_lattice[j]	7
he_std_w2;	7
model->ff_layers[i].bias2[j]	7
model->layer_norms	7
(cllmlayernorm*)calloc(config->num_layers	7
2,	77
sizeof(cllmlayernorm));	14
(!model->layer_norms)	14
norms\n");	7
layer:	35
pre-attention	7
pre-feedforward)	7
model->layer_norms[i].layer_id	7
model->layer_norms[i].dim	7
model->layer_norms[i].epsilon	14
1e-5f;	7
model->layer_norms[i].gamma	7
model->layer_norms[i].beta	7
model->layer_norms[i].gamma[j]	7
1.0f;	308
model->layer_norms[i].beta[j]	7
positional	245
encoding	252
model->pos_encoding.max_length	21
model->pos_encoding.embedding_dim	7
pos_size	14
config->max_seq_len	21
model->pos_encoding.spiral_positions	7
(float*)calloc(config->max_seq_len	28
config->embedding_dim,	28
model->pos_encoding.clock_positions	7
model->pos_encoding.prime_positions	7
model->pos_encoding.learned_positions	7
(!model->pos_encoding.spiral_positions	7
!model->pos_encoding.clock_positions	7
!model->pos_encoding.prime_positions	7
!model->pos_encoding.learned_positions)	7
encodings\n");	7
(model->pos_encoding.spiral_positions)	28
free(model->pos_encoding.spiral_positions);	21
(model->pos_encoding.clock_positions)	21
free(model->pos_encoding.clock_positions);	21
(model->pos_encoding.prime_positions)	21
free(model->pos_encoding.prime_positions);	21
(model->pos_encoding.learned_positions)	28
free(model->pos_encoding.learned_positions);	21
free(model->layer_norms);	21
model;	42
associated	42
cllm_free_model(cllmmodel*	7
(model->layer_norms)	21
(model->ff_layers)	21
(model->attention_layers)	28
(model->weights)	7
(model->tokens)	14
(model->lattice_points)	7
free(model->lattice_points);	14
cllm_estimate_memory(const	7
sizeof(cllmmodel);	21
sizeof(cllmtoken);	14
total_weights	21
sizeof(attentionlayer);	14
sizeof(feedforwardlayer);	14
sizeof(cllmlayernorm);	14
encodings	49
(4	14
types)	7
total;	98
note:	147
cllm_validate_model	7
already	203
defined	28
cllm_utils.c	7
print	189
information	56
cllm_print_model_info(const	7
printf("===	98
===\n");	175
printf("version:	14
model->header.version);	7
printf("vocabulary	28
printf("embedding	14
printf("number	7
printf("total	119
(model->num_layers	21
model->attention_layers)	35
printf("\nattention	7
heads:	21
model->attention_layers[0].num_heads);	14
model->attention_layers[0].head_dim);	14
model->ff_layers)	42
printf("\nfeed-forward	7
model->ff_layers[0].input_dim);	7
model->ff_layers[0].hidden_dim);	14
usage:	14
printf("==============================\n");	7
testing	28
cllm_create_small_model(void)	7
cllmconfig	35
.vocab_size	35
1000,	14
.embedding_dim	35
128,	7
.num_layers	35
.num_heads	35
.ff_dim	35
512,	14
.max_seq_len	35
.dropout	35
0.1f	126
};	126
cllm_create_model(&config);	28
medium	7
cllm_create_medium_model(void)	7
50000,	21
increased	63
coverage	7
1024,	35
richer	14
representations	7
4096,	21
more	140
capacity	35
large	147
cllm_create_large_model(void)	7
12,	56
16,	7
2048,	7
advanced	105
features	105
leverages	14
structure:	7
cvp	28
(closest	14
problem)	28
lookup	56
svp	21
(shortest	14
optimal	98
factorization	98
caching	14
faster	35
spatial	91
indexing	7
"prime_lattice.h"	21
entry	35
factors;	7
num_factors;	7
primefactorization;	7
primefactorization*	35
cache;	14
capacity;	56
primefactorcache;	7
y,	98
z;	21
spatialtoken;	7
spatialtoken*	14
tokens;	56
num_tokens;	105
int*	126
spatial_index;	14
sorted	7
proximity	7
ulamspatialindex;	7
factor	154
primefactorcache*	21
create_prime_factor_cache(int	7
capacity)	28
(primefactorcache*)malloc(sizeof(primefactorcache));	7
cache->cache	7
(primefactorization*)calloc(capacity,	7
sizeof(primefactorization));	14
cache->capacity	7
cache->size	7
free_prime_factor_cache(primefactorcache*	7
cache)	14
(!cache)	14
cache->size;	14
free(cache->cache[i].factors);	7
free(cache->cache);	7
free(cache);	7
factorize	7
into	105
factorize_number(uint32_t	7
uint32_t**	14
*factors	14
possible	7
factors	14
(uint32_t*)malloc(32	7
out	581
2s	7
temp[count++]	21
odd	14
still	28
1,	518
(uint32_t*)malloc(count	14
memcpy(*factors,	7
temp,	42
count;	161
free(temp);	63
(with	7
caching)	7
get_prime_factorization(primefactorcache*	7
(cache->cache[i].number	7
&cache->cache[i];	7
(cache->size	14
cache->capacity)	7
full,	7
replace	35
oldest	14
free(cache->cache[0].factors);	7
memmove(&cache->cache[0],	7
&cache->cache[1],	7
cache->size--;	7
&cache->cache[cache->size++];	7
entry->number	7
factorize_number(n,	7
&entry->factors,	7
&entry->num_factors);	7
entry;	49
fast	42
factorizations	14
fast_gcd_cached(primefactorcache*	7
a,	329
b)	280
(a	77
fa	7
get_prime_factorization(cache,	14
a);	42
fb	7
b);	70
common	84
fa->num_factors	7
fb->num_factors)	7
(fa->factors[i]	14
fb->factors[j])	14
fa->factors[i];	7
i++;	14
j++;	14
gcd;	14
compute_ulam_position(uint32_t	14
z)	7
*x	252
*y	203
*z	21
2.39996322972865332f;	14
2π/φ²	14
prime_sqrtf((float)token_id);	14
(float)token_id	28
prime_cosf(angle);	14
prime_sinf(angle);	14
prime_logf((float)token_id	14
1.0f);	56
ulamspatialindex*	21
create_ulam_spatial_index(uint32_t	7
vocab_size)	140
(ulamspatialindex*)malloc(sizeof(ulamspatialindex));	7
index->num_tokens	7
index->tokens	7
(spatialtoken*)malloc(vocab_size	7
sizeof(spatialtoken));	7
index->spatial_index	7
(int*)malloc(vocab_size	7
sizeof(int));	56
index->tokens[i].token_id	7
compute_ulam_position(i,	7
&index->tokens[i].x,	7
&index->tokens[i].y,	7
&index->tokens[i].z);	7
index->spatial_index[i]	7
index;	14
free_ulam_spatial_index(ulamspatialindex*	7
index)	28
(!index)	7
free(index->tokens);	7
free(index->spatial_index);	7
free(index);	7
spatially	14
close	14
optimization)	21
find_nearby_tokens(ulamspatialindex*	7
index,	14
distances)	7
(uint32_t)index->num_tokens)	7
&index->tokens[token_id];	7
nearby	21
(int*)malloc(k	14
distances	28
all_distances	7
(float*)malloc(index->num_tokens	7
index->num_tokens;	14
dx	77
index->tokens[i].x	7
target->x;	7
dy	84
index->tokens[i].y	7
target->y;	7
dz	49
index->tokens[i].z	7
target->z;	7
all_distances[i]	7
prime_sqrtf(dx*dx	21
dy*dy	35
dz*dz);	35
nearest	91
(simple	63
selection,	7
could	28
heap)	7
k;	28
min_idx	28
min_dist	42
infinity;	49
(all_distances[j]	7
min_dist)	21
selected	14
already_selected	28
m	266
m++)	14
(nearby[m]	7
(!already_selected)	7
all_distances[j];	7
nearby[i]	7
min_idx;	7
(distances)	7
distances[i]	21
min_dist;	7
free(all_distances);	7
nearby;	7
given	35
an	35
closest	49
lattice.	28
accurate	7
than	63
product	175
similarity.	7
cvp_find_closest_token(cllmmodel*	7
query_embedding)	7
!query_embedding)	7
model->embeddings.embeddings;	35
closest_token	14
min_distance	28
minimum	63
euclidean	98
v++)	91
query_embedding[d]	7
embeddings[v	35
d];	56
(distance	7
min_distance)	14
distance;	7
v;	14
closest_token;	7
shortest	56
non-zero	42
can	56
optimize	14
initialization.	7
svp_find_shortest_vector(cllmmodel*	7
(float*)malloc(embed_dim	14
min_length	14
val	147
val;	91
prime_sqrtf(length);	7
(length	7
1e-6f	7
min_length)	7
length;	7
memcpy(shortest,	7
&embeddings[v	7
embed_dim],	7
shortest;	7
factor_cache;	7
use_cvp;	7
use_cached_gcd;	7
crystallineadvancedstate;	7
crystallineadvancedstate*	21
crystalline_advanced_create(cllmmodel*	7
(crystallineadvancedstate*)malloc(sizeof(crystallineadvancedstate));	7
(cache	14
up	175
factorizations)	7
state->factor_cache	7
create_prime_factor_cache(10000);	7
state->spatial_index	7
create_ulam_spatial_index(model->vocab_size);	7
state->use_cvp	7
state->use_cached_gcd	7
printf("advanced	7
initialized\n");	21
printf("-	14
cache:	21
entries\n");	7
index:	7
tokens\n",	56
state;	56
crystalline_advanced_free(crystallineadvancedstate*	7
state)	126
(!state)	140
free_prime_factor_cache(state->factor_cache);	7
free_ulam_spatial_index(state->spatial_index);	7
free(state);	91
similarity	189
crystalline_advanced_similarity(crystallineadvancedstate*	7
state,	154
token1,	35
token2)	21
(!state	98
token1	49
token2	35
enabled	84
(state->use_cached_gcd)	7
shared	91
fast_gcd_cached(state->factor_cache,	7
token2);	14
token2;	28
(float)shared	21
(float)max_val;	28
fallback	105
standard	126
(float)a	7
crystalline_prefetch_nearby(crystallineadvancedstate*	7
k)	42
!model	7
find_nearby_tokens(state->spatial_index,	7
their	7
(hint	7
cpu	84
nearby_token	7
nearby[i];	7
(nearby_token	7
&model->embeddings.embeddings[nearby_token	7
model->embedding_dim];	7
__builtin_prefetch(embedding,	7
3);	77
read,	7
high	7
temporal	7
locality	49
free(nearby);	7
with:	14
q→k	28
reversal	21
(query	7
transformation)	7
hyperdimensional	56
resonance	140
coordinate-based	7
symmetry	602
(rotations,	7
reflections)	7
fourier-based	14
dampening	35
plimpton	63
ratio	112
integration	14
einstein	21
lambda	70
correction	154
cymatic	42
frequency	77
prime-based	98
metrics	182
"../include/prime_lattice_core.h"	14
constants	63
pi	224
3.14159265358979323846	35
#ifndef	7
phi	112
1.618033988749894848	7
einstein_lambda	7
(3.0	7
144000.0)	7
schumann_resonance	14
7.83	7
gamma_burst	14
40.0	7
frequencies	98
(hz)	14
cymatic_freqs[]	7
{432.0f,	7
528.0f,	7
639.0f,	7
741.0f,	7
852.0f,	7
963.0f};	7
num_cymatic_freqs	7
6;	21
ratios	21
babylonian	21
tablet)	7
p;	98
q;	49
ratio;	7
plimptonratio;	7
plimptonratio	14
plimpton_ratios[]	7
{2.0f,	7
1.0f,	14
0.75f},	7
(4-1)/(4+1)	7
3/5	7
{3.0f,	7
2.0f,	14
0.384615f},	7
(9-4)/(9+4)	7
5/13	7
{4.0f,	7
3.0f,	7
0.28f},	7
(16-9)/(16+9)	7
7/25	7
{5.0f,	7
4.0f,	7
0.219512f},	7
(25-16)/(25+16)	7
9/41	7
num_plimpton_ratios	7
4;	168
between	154
two	112
points	84
metric	21
incorporates:	7
space	161
coprimality	7
bonus	14
coords1	7
[3]	35
coords2	7
prime2	21
@return	161
compute_lattice_distance(const	7
coords1,	14
