<PAD>	0
<UNK>	0
<BOS>	0
<EOS>	0
<MASK>	0
/*	137
*	3651
cllm	54
lattice	131
conversion	13
utilities	14
*/	666
#include	545
"../../include/cllm.h"	1
"../../include/bigfixed_core.h"	2
"../../include/bigint_core.h"	3
"../../include/prime_types.h"	1
<stdlib.h>	76
<string.h>	78
<stdio.h>	68
"../include/prime_float_math.h"	33
void	519
cllm_float_to_bigfixed(bigfixed*	1
output,	23
float*	316
input,	25
int	955
n,	52
precision)	15
{	4437
(void)precision;	4
unused	11
parameter	12
-	792
kept	2
for	1523
api	10
compatibility	7
if	3302
(!output	3
||	905
!input	12
n	139
<=	257
0)	537
return;	510
(int	499
i	1418
=	6441
0;	1626
<	1339
n;	70
i++)	629
big_fixed_from_double(&output[i],	1
(double)input[i]);	1
}	4419
cllm_bigfixed_to_float(float*	1
bigfixed*	15
n)	74
output[i]	7
(float)big_fixed_to_double(&input[i]);	1
cllm_embeddings_to_basis(bigfixed**	1
basis,	19
embeddings,	5
dim,	18
(!basis	4
!embeddings	1
0	220
dim	81
cllm_float_to_bigfixed(basis[i],	1
&embeddings[i	1
dim],	3
precision);	13
cllm_basis_to_embeddings(float*	1
bigfixed**	15
dim)	24
(!embeddings	3
!basis	6
cllm_bigfixed_to_float(&embeddings[i	1
basis[i],	1
dim);	23
cllm_alloc_bigfixed_basis(int	1
(n	86
return	2064
null;	455
basis	60
(bigfixed**)malloc(n	5
sizeof(bigfixed*));	6
(!basis)	2
basis[i]	2
(bigfixed*)malloc(dim	4
sizeof(bigfixed));	10
(!basis[i])	1
j	232
i;	69
j++)	103
free(basis[j]);	1
free(basis);	2
d	126
dim;	58
d++)	50
big_fixed_from_int(&basis[i][d],	1
0);	164
basis;	3
cllm_free_bigfixed_basis(bigfixed**	1
(basis[i])	1
free(basis[i]);	1
cllm_embedding_to_bigfixed(bigfixed*	1
embedding,	17
cllm_float_to_bigfixed(output,	1
cllm_bigfixed_to_embedding(float*	1
vector,	3
cllm_bigfixed_to_float(embedding,	1
float	675
cllm_test_conversion_accuracy(float*	1
(!input	3
-1.0f;	7
bigfixed	213
(bigfixed*)malloc(n	5
output	85
(float*)malloc(n	1
sizeof(float));	229
(!bigfixed	1
!output)	8
(bigfixed)	1
free(bigfixed);	2
(output)	5
free(output);	13
cllm_float_to_bigfixed(bigfixed,	1
cllm_bigfixed_to_float(output,	1
bigfixed,	1
n);	24
max_error	4
0.0f;	233
error	8
prime_fabsf(output[i]	1
input[i]);	1
(error	7
>	417
max_error)	1
error;	1
max_error;	2
cllm_print_conversion_stats(float*	1
cllm_test_conversion_accuracy(input,	1
printf("conversion	1
statistics:\n");	12
printf("	241
elements:	1
%d\n",	82
precision:	7
%d	59
bits\n",	1
max	24
error:	3
%.10e\n",	1
max_error);	1
(max_error	3
1e-6f)	3
status:	4
excellent	1
1e-6)\n");	1
else	190
1e-4f)	1
good	4
1e-4)\n");	1
1e-2f)	1
acceptable	1
1e-2)\n");	2
warning	10
>=	182
pure	10
crystalline	58
embeddings	57
implementation	45
implements	17
crystallineembeddings	3
with	158
lll-reduced	2
exact	5
token	118
positions,	1
and	167
morphology	5
graph.	1
implementation:	5
uses	41
only	14
arbitrary	15
precision	49
mathematics.	2
no	46
external	7
math	9
libraries	2
(math.h,	2
gmp,	2
etc.)	5
"cllm_pure_crystalline.h"	3
helper	21
function	33
to	537
allocate	140
matrix	50
static	227
allocate_bigfixed_matrix(uint32_t	1
rows,	4
uint32_t	310
cols,	1
(bigfixed**)malloc(rows	1
(!matrix)	2
(uint32_t	270
rows;	10
matrix[i]	1
(bigfixed*)malloc(cols	1
(!matrix[i])	1
//	3757
cleanup	43
on	67
failure	9
free(matrix[j]);	1
free(matrix);	3
initialize	182
each	45
cols;	11
bigint	226
structures	9
matrix[i][j].integer_part	1
(bigint*)malloc(sizeof(bigint));	55
matrix[i][j].fractional_part	1
(!matrix[i][j].integer_part	1
!matrix[i][j].fractional_part)	1
k	60
k++)	13
l	10
l++)	4
big_free(matrix[k][l].integer_part);	1
free(matrix[k][l].integer_part);	1
big_free(matrix[k][l].fractional_part);	1
free(matrix[k][l].fractional_part);	1
free(matrix[k]);	1
(j	4
j;	18
big_free(matrix[i][l].integer_part);	1
free(matrix[i][l].integer_part);	1
big_free(matrix[i][l].fractional_part);	1
free(matrix[i][l].fractional_part);	1
free(matrix[i]);	2
big_init(matrix[i][j].integer_part);	1
big_init(matrix[i][j].fractional_part);	1
matrix[i][j].scale_bits	1
precision;	8
matrix[i][j].negative	1
matrix;	1
free	116
free_bigfixed_matrix(bigfixed**	1
matrix,	3
cols)	3
(matrix[i])	1
(matrix[i][j].integer_part)	1
big_free(matrix[i][j].integer_part);	1
free(matrix[i][j].integer_part);	1
(matrix[i][j].fractional_part)	1
big_free(matrix[i][j].fractional_part);	1
free(matrix[i][j].fractional_part);	1
create	121
new	24
structure	49
crystallineembeddings*	2
crystalline_embeddings_create(uint32_t	1
vocab_size,	13
lattice_dim)	1
(vocab_size	2
==	584
lattice_dim	2
fprintf(stderr,	292
"error:	164
vocab_size	54
must	30
be	60
0\n");	20
(crystallineembeddings*)malloc(sizeof(crystallineembeddings));	1
(!embeddings)	4
failed	71
crystallineembeddings\n");	1
embeddings->vocab_size	1
vocab_size;	45
embeddings->lattice_dim	3
lattice_dim;	1
embeddings->basis_optimized	1
false;	303
embeddings->optimization_epoch	1
embeddings->total_lookups	1
embeddings->cache_hits	1
embeddings->avg_lookup_time	1
0.0;	111
(identity	1
initially)	1
embeddings->lattice_basis	1
allocate_bigfixed_matrix(lattice_dim,	2
lattice_dim,	16
256);	7
(!embeddings->lattice_basis)	1
free(embeddings);	9
inverse	30
embeddings->inverse_basis	1
(!embeddings->inverse_basis)	1
free_bigfixed_matrix(embeddings->lattice_basis,	8
lattice_dim);	17
array	59
embeddings->tokens	1
(crystallinetoken**)calloc(vocab_size,	1
sizeof(crystallinetoken*));	1
(!embeddings->tokens)	1
free_bigfixed_matrix(embeddings->inverse_basis,	7
positions	8
embeddings->token_positions	1
allocate_bigfixed_matrix(vocab_size,	1
(!embeddings->token_positions)	1
free(embeddings->tokens);	6
primes	30
embeddings->token_primes	1
(uint64_t*)calloc(vocab_size,	1
sizeof(uint64_t));	5
(!embeddings->token_primes)	1
free_bigfixed_matrix(embeddings->token_positions,	5
graph	2
embeddings->morphology_graph	1
(uint32_t**)malloc(vocab_size	1
sizeof(uint32_t*));	1
(!embeddings->morphology_graph)	1
free(embeddings->token_primes);	4
embeddings->morphology_graph[i]	1
(uint32_t*)calloc(max_derived_tokens,	1
sizeof(uint32_t));	40
(!embeddings->morphology_graph[i])	1
free(embeddings->morphology_graph[j]);	1
free(embeddings->morphology_graph);	3
counts	3
embeddings->morphology_counts	1
(uint8_t*)calloc(vocab_size,	1
sizeof(uint8_t));	1
(!embeddings->morphology_counts)	1
free(embeddings->morphology_graph[i]);	2
embeddings;	1
crystalline_embeddings_free(crystallineembeddings*	1
embeddings)	2
(embeddings->morphology_counts)	1
free(embeddings->morphology_counts);	1
(embeddings->morphology_graph)	1
embeddings->vocab_size;	1
(embeddings->morphology_graph[i])	1
(embeddings->token_primes)	1
(embeddings->token_positions)	1
embeddings->vocab_size,	1
embeddings->lattice_dim);	3
tokens	86
(but	1
don't	12
the	154
objects	1
themselves	1
they're	4
owned	3
by	60
caller)	1
(embeddings->tokens)	1
(embeddings->inverse_basis)	1
embeddings->lattice_dim,	2
(embeddings->lattice_basis)	1
add	61
bool	164
crystalline_embeddings_add_token(crystallineembeddings*	1
crystallinetoken*	4
token)	6
!token)	3
null	32
or	45
token\n");	1
(token->token_id	1
embeddings->vocab_size)	3
token_id	29
%u	30
%u\n",	59
token->token_id,	1
embeddings->vocab_size);	3
store	18
pointer	8
embeddings->tokens[token->token_id]	1
token;	6
prime	189
embeddings->token_primes[token->token_id]	1
token->prime;	1
copy	53
position	64
(from	2
ulam	21
spiral	35
coordinates)	1
&&	287
3;	44
big_fixed_assign(&embeddings->token_positions[token->token_id][i],	1
&token->lattice_coords[i]);	1
true;	142
get	98
from	135
crystalline_embeddings_get_token(crystallineembeddings*	1
token_id)	6
embeddings\n");	4
(token_id	20
token_id,	18
embeddings->tokens[token_id];	1
identity	11
crystalline_initialize_basis(crystallineembeddings*	1
set	52
embeddings->lattice_dim;	4
(i	56
j)	8
1.0	24
big_from_int(embeddings->lattice_basis[i][j].integer_part,	2
1);	216
big_from_int(embeddings->lattice_basis[i][j].fractional_part,	2
0.0	14
embeddings->lattice_basis[i][j].negative	1
(same	3
as	33
identity)	1
big_from_int(embeddings->inverse_basis[i][j].integer_part,	2
big_from_int(embeddings->inverse_basis[i][j].fractional_part,	2
embeddings->inverse_basis[i][j].negative	1
compute	173
(currently	1
just	15
copies	2
token's	4
lattice_coords)	1
crystalline_compute_token_position(crystallineembeddings*	1
position[3])	1
!position)	1
position\n");	4
stored	7
big_fixed_assign(&position[i],	1
&embeddings->token_positions[token_id][i]);	1
operations	36
"../../include/cllm_pure_crystalline.h"	1
"../../include/prime_math_custom.h"	1
"../../include/prime_bigint_transcendental.h"	1
"../../include/bigfixed_constants.h"	1
#define	50
prime_cache_size	2
10000	3
uint64_t	348
prime_cache[prime_cache_size];	2
prime_cache_initialized	4
integer	39
square	9
root	35
using	96
newton's	5
method	3
floating	1
point	10
isqrt(uint64_t	2
3)	10
1;	271
initial	8
guess	6
x	168
y	32
(x	92
+	874
1)	152
/	508
2;	91
method:	3
x_new	2
n/x)	3
2	96
while	149
(y	17
x)	71
y;	20
x;	31
init_prime_cache(void)	2
(prime_cache_initialized)	2
prime_cache[0]	2
prime_cache[1]	2
count	109
candidate	21
5;	13
(count	17
prime_cache_size)	5
is_prime	16
sqrt_cand	2
isqrt(candidate);	1
prime_cache[i]	5
sqrt_cand;	2
(candidate	3
%	147
break;	186
(is_prime)	6
